[
    {
        "id": "1",
        "title": "Trek 820 - 2016",
        "content": "Hit the trails with confidence on the 2016 Trek 820, a standout model in the Mountaiirls Hawaii 1 16 byn Bikes category. Engineered by the renowned brand Trek, this bike is designed to tackle rugged landscapes and elevate your mountain biking experience. Its sturdy frame and superior craftsmanship from the 2016 lineup promise reliability on every ride. Priced at an affordable $379.99, the Trek 820 offers exceptional value for both novice and seasoned mountain bikers alike. Embark on your next adventure with the quality and performance that Trek is known for."
    },
    {
        "id": "2",
        "title": "Ritchey Timberwolf Frameset - 2016",
        "content": "Unleash the thrill-seeker in you with the 2016 Ritchey Timberwolf Frameset. As part of the Mountain Bikes category, this frameset is the perfect starting point for cyclists who want to build their dream mountain bike. Ritchey, known for its quality craftsmanship, offers a frameset that's both lightweight and durable, ready to tackle any challenge you throw at it. The model year 2016 reflects a blend of traditional design with modern innovation, priced at an attractive $749.99. Gear up for your next off-road adventure with the Ritchey Timberwolf Frameset."
    },
    {
        "id": "3",
        "title": "Surly Wednesday Frameset - 2016",
        "content": "Embrace the challenges of off-road adventures with the 2016 Surly Wednesday Frameset. Crafted for the Mountain Bikes category, this durable frameset is the foundation for building a custom bike tailored to your trail-riding needs. Surly's commitment to quality is evident in this robust and versatile frameset, which is designed to provide a balanced ride even on the most unpredictable terrains. The model year 2016 signifies a reliable setup for enthusiasts and professionals alike, with a list price of $999.99 reflecting the premium build and performance capabilities. Start your mountain biking journey with the strength and resilience of Surly's Wednesday Frameset."
    },
    {
        "id": "4",
        "title": "Trek Fuel EX 8 29 - 2016",
        "content": "Hit the trails with confidence on the 2016 Trek Fuel EX 8 29, a premium addition to the Mountain Bikes category. Designed by the renowned brand Trek, this model is built for those who seek adventure and performance. The 29-inch wheels provide stability and control on rough terrains, while its advanced frame technology ensures a comfortable and efficient ride. With a model year of 2016, the Trek Fuel EX 8 29 is equipped with modern features that cater to both amateur and professional riders. Available for $2899.99, this mountain bike promises quality and exhilaration for those passionate about off-road cycling."
    },
    {
        "id": "5",
        "title": "Heller Shagamaw Frame - 2016",
        "content": "Unleash your inner trailblazer with the 2016 Heller Shagamaw Frame. As part of the Mountain Bikes category, this frame is the perfect foundation for building a custom bike that can tackle the most challenging terrains. Heller's dedication to precision and durability shines in the Shagamaw Frame's design, offering riders a reliable base for their mountain biking adventures. The model year 2016 reflects a commitment to quality that has been tested over time. With a list price of $1320.99, it's an investment in top-tier performance for serious cyclists who want to create their dream mountain bike."
    },
    {
        "id": "6",
        "title": "Ice Cream Truck Frameset by Surly",
        "content": "Build your dream all-terrain bike with the 2016 Surly Ice Cream Truck Frameset. This frame, a favorite among Mountain Bikes enthusiasts, provides a solid foundation for a custom setup designed to tackle snowy trails, sandy dunes, and rocky climbs. The model year 2016 represents Surly's commitment to durability and versatility in the world of off-road cycling. With a list price of $469.99, it's an inviting starting point for cyclists looking to craft a mountain bike that's truly their own. Embrace the challenge of the wild with Surly's robust and reliable Ice Cream Truck Frameset."
    },
    {
        "id": "7",
        "title": "Trek Slash 8 27.5 - 2016",
        "content": "Hit the trails with confidence on the 2016 Trek Slash 8 27.5, a premium addition to the Mountain Bikes category. Crafted by the renowned brand Trek, this high-performance mountain bike is engineered to tackle the most challenging descents and technical climbs. The 27.5-inch wheels offer a perfect balance of agility and stability, making it a favorite among trail enthusiasts. With a model year of 2016, it incorporates seasoned technology proven on the trails. Priced at $3999.99, the Trek Slash 8 27.5 represents a significant investment in your off-road adventures, delivering quality and reliability that serious riders demand."
    },
    {
        "id": "8",
        "title": "Trek Remedy 29 Carbon Frameset - 2016",
        "content": "Hit the trails with the precision and durability of the 2016 Trek Remedy 29 Carbon Frameset. Perfectly placed in the Mountain Bikes category, this high-quality frameset is engineered for adventurers and serious mountain bikers alike. With the lightweight and robust carbon construction, it promises to enhance your uphill climbs and downhill sprints. The 2016 model year is a testament to Trek's legacy of integrating cutting-edge technology with timeless design. At a list price of $1799.99, the Trek Remedy 29 Carbon Frameset offers an exceptional foundation for building your dream mountain bike."
    },
    {
        "id": "9",
        "title": "Trek Conduit+ - 2016",
        "content": "Elevate your cycling experience with the 2016 Trek Conduit+, a top-tier electric bike designed for the modern rider. As part of the Electric Bikes category, it offers a seamless blend of efficiency and power, making your commutes and leisure rides more enjoyable. Crafted by the renowned brand Trek, this model stands out with its advanced features and robust construction. With a model year of 2016, it is equipped with reliable technology to enhance your rides. The list price of $2999.99 is a testament to its premium quality and the exceptional performance it delivers. Get ready to power up your journeys with the Trek Conduit+."
    },
    {
        "id": "10",
        "title": "Surly Straggler - 2016",
        "content": "Hit the dirt trails or navigate urban roads with the 2016 Surly Straggler. This versatile cyclocross bicycle, a standout in the Cyclocross Bicycles category, is built to excel in a variety of riding conditions. The Surly Straggler offers a perfect blend of durability, performance, and agility, making it an ideal choice for riders who demand flexibility in their ride. Crafted with the model year 2016's technology, it promises reliability and a smooth experience. With a list price of $1549.00, this Surly bike is an investment in top-notch quality for serious cyclists looking for a robust companion on their diverse biking adventures."
    },
    {
        "id": "11",
        "title": "Surly Straggler 650b - 2016",
        "content": "Embrace the challenge of mixed terrain riding with the 2016 Surly Straggler 650b. This versatile cyclocross bicycle is tailored for those who seek adventure on both roads and dirt trails. As a part of the Cyclocross Bicycles category, the Surly Straggler is built to adapt to various conditions with agility and reliability. The bike's robust construction and the 2016 model year technology offer a blend of performance and durability. With a list price of $1680.99, it's a premium choice for cyclists who demand excellence in every pedal stroke. Gear up for your next cyclocross escapade with the Surly Straggler 650b."
    },
    {
        "id": "12",
        "title": "Electra Townie Original 21D - 2016",
        "content": "Cruise around town in style with the 2016 Electra Townie Original 21D. This chic cruiser bicycle, falling under the Cruisers Bicycles category, offers a comfortable and stylish ride for your urban adventures. The bike is engineered for a relaxing ride, letting you enjoy the scenery and the breeze. With the model year 2016, you benefit from Electra's design expertise and quality craftsmanship. Priced at $549.99, the Townie Original 21D provides a fantastic combination of comfort, style, and affordability. Embrace the relaxed pace of life on two wheels with Electra's Townie Original 21D."
    },
    {
        "id": "13",
        "title": "Electra Cruiser 1 (24-Inch) by Electra",
        "content": "Cruise the boardwalk or meander through the neighborhood with the 2016 Electra Cruiser 1 (24-Inch). This stylish cruiser bicycle, belonging to the Cruisers Bicycles category, offers a comfortable and relaxed riding experience. Boasting a classic design and a smooth ride, it's perfect for casual jaunts and soaking in the scenery. The 2016 model year combines timeless appeal with contemporary features, and with a list price of $269.99, it's an affordable option for those looking to enjoy the simpler pleasures of cycling. Electra's reputation for quality and fun is fully embodied in this charming cruiser."
    },
    {
        "id": "14",
        "title": "Electra Girls Hawaii 1 (16-inch) - 2015/2016",
        "content": "Introduce your little one to the joy of cycling with the Electra Girls Hawaii 1 (16-inch) from the 2015/2016 collection. This charming cruiser bicycle, which falls under the Cruisers Bicycles category, is perfect for casual rides around the neighborhood or park. The Electra brand is known for its attention to detail and quality, and this bike is no exception. With a model year of 2016, it combines classic design with modern features. Priced at $269.99, the Electra Girls Hawaii 1 is an excellent choice for young riders ready to embark on two-wheeled adventures."
    },
    {
        "id": "15",
        "title": "Electra Moto 1 - 2016",
        "content": "Cruise the streets in style with the 2016 Electra Moto 1. This sleek cruiser bicycle, falling under the category of Cruisers Bicycles, offers a smooth and comfortable ride for both urban adventures and leisurely weekend jaunts. The model year 2016 signifies a blend of classic design with modern functionality, and the list price of $529.99 ensures you get a high-quality ride without breaking the bank. Electra's reputation for creating bikes with character and reliability makes the Moto 1 a must-have for casual cyclists seeking fun and flair."
    },
    {
        "id": "16",
        "title": "Electra Townie Original 7D EQ - 2016",
        "content": "Cruise the city streets in style with the 2016 Electra Townie Original 7D EQ. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, is perfect for leisurely rides and comfortable commutes. It offers a smooth and easy-going ride experience, thanks to its thoughtful design and reliable performance. The model year 2016 combines timeless charm with modern functionality, ensuring you enjoy the best of both worlds. With a list price of $599.99, it's an affordable option for those looking for quality and comfort in their two-wheeled adventures. Get ready to turn heads and enjoy the ride with Electra's renowned craftsmanship."
    },
    {
        "id": "17",
        "title": "Pure Cycles Vine 8-Speed - 2016",
        "content": "Cruise the city streets in style with the 2016 Pure Cycles Vine 8-Speed. This elegant bike, falling under the Cruisers Bicycles category, offers a blend of comfort and simplicity for the urban rider. Boasting a model year of 2016, it features a smooth 8-speed transmission that's perfect for flat roads or gentle hills. The Pure Cycles brand ensures a high-quality build and reliable performance, all at a reasonable list price of $429.00. Make your daily commute or weekend leisure rides more enjoyable with the Vine 8-Speed cruiser."
    },
    {
        "id": "18",
        "title": "Pure Cycles Western 3-Speed - Womens",
        "content": "Embark on a leisurely ride with the 2016 Pure Cycles Western 3-Speed, specifically designed for women. This elegant cruiser, nestled in the Cruisers Bicycles category, offers a smooth and comfortable journey. Whether you're cruising along the beach or navigating through the city, the 2016 model year ensures a blend of contemporary design with classic functionality. Priced at $449.00, this Pure Cycles bike represents a fantastic blend of style, comfort, and affordability. Make your rides a delightful experience with the Western 3-Speed's commitment to quality and durability."
    },
    {
        "id": "19",
        "title": "Pure Cycles William 3-Speed - 2016",
        "content": "Cruise through your city in style with the 2016 Pure Cycles William 3-Speed. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, is perfect for a relaxed ride around town. It combines a classic design with modern functionality, offering three speeds to tackle various inclines with ease. The model year 2016 brings with it a sense of reliability, while the affordable list price of $449.00 makes it a great choice for those seeking both quality and value. Make your urban adventures unforgettable with the craftsmanship of Pure Cycles."
    },
    {
        "id": "20",
        "title": "Electra Townie Original 7D EQ - Women's by Electra",
        "content": "Experience the joy of cruising through your neighborhood with the 2016 Electra Townie Original 7D EQ - Women's. This elegant cruiser bicycle, nestled in the Cruisers Bicycles category, is perfect for leisurely rides and comfortable commutes. The bike's thoughtful design combines style with functionality, making it a great choice for those who value both aesthetics and riding comfort. With a model year of 2016, this bike boasts reliable features that have stood the test of time. Priced at $599.99, the Electra Townie Original 7D EQ offers a fantastic blend of quality and affordability for those looking to enjoy the cruiser lifestyle."
    },
    {
        "id": "21",
        "title": "Electra Cruiser 1 (24-Inch) by Electra",
        "content": "Introduce your child to the joy of cycling with the 2016 Electra Cruiser 1 (24-Inch). Perfectly designed for young riders, this bike falls under the Children Bicycles category and offers a comfortable and stylish ride. The 2016 model year combines classic looks with modern features for kids who want to ride in style. With a list price of $269.99, the Electra Cruiser 1 is an affordable option that doesn't compromise on quality or the fun factor. Electra's reputation for creating durable and kid-friendly bikes means you can trust in a smooth and safe riding experience for your little adventurer."
    },
    {
        "id": "22",
        "title": "Electra Girls Hawaii 1 (16-inch) - 2015/2016",
        "content": "Introduce your little one to the joy of cycling with the 2016 Electra Girls Hawaii 1 (16-inch). This charming bike, falling under the category of Children Bicycles, is perfect for young riders ready to embark on their biking adventures. Featuring a delightful design tailored for girls and a comfortable build to suit their size, this bike is a wonderful choice for children. The model year 2016 means it's equipped with kid-friendly features and the list price of $269.99 ensures you're getting a delightful and reliable bike without breaking the bank. Electra's reputation for creating fun and safe children's bikes shines through with this Hawaii 1 model."
    },
    {
        "id": "23",
        "title": "Electra Girls Hawaii 1 (20-inch) - 2015/2016",
        "content": "Introduce your little one to the joy of cycling with the Electra Girls Hawaii 1 (20-inch) for the 2015/2016 model year. This charming bike, falling under the Children Bicycles category, features a fun and vibrant design that is perfect for young riders. The 2016 model year combines contemporary features with reliable performance, ensuring a safe and enjoyable ride for kids. Priced at $299.99, this Electra bicycle offers a great balance of quality and affordability, making it an ideal choice for your child's first biking adventures."
    },
    {
        "id": "24",
        "title": "Electra Townie Original 21D - 2016",
        "content": "Ride in comfort and style with the 2016 Electra Townie Original 21D. This elegant comfort bicycle is part of the Comfort Bicycles category, perfect for leisurely rides around town or casual jaunts through the park. The 2016 model year combines classic design with modern features, ensuring a smooth and enjoyable cycling experience. With a list price of $549.99, the Electra Townie Original 21D offers an affordable way to add a touch of luxury to your daily routine. Get ready to pedal through your days with the unmatched quality and comfort that Electra is known for."
    },
    {
        "id": "25",
        "title": "Electra Townie Original 7D - 2015/2016",
        "content": "Cruise through your neighborhood with style and ease on the Electra Townie Original 7D. This delightful ride, falling under the Comfort Bicycles category, is perfect for relaxed outings and casual commutes. The 2016 model is a testament to Electra's dedication to comfortable design and enjoyable cycling experiences. With a list price of $499.99, the Electra Townie Original 7D offers a blend of affordability and quality, ensuring a smooth ride without breaking the bank. Embrace the joy of leisurely biking with the Electra Townie Original 7D."
    },
    {
        "id": "26",
        "title": "Electra Townie Original 7D EQ - 2016",
        "content": "Enjoy a blend of comfort and style with the 2016 Electra Townie Original 7D EQ. This exquisite comfort bicycle is perfect for leisurely rides around town or for casual weekend excursions. As a part of the Comfort Bicycles category, it promises a smooth and enjoyable riding experience. The 2016 model year combines classic design with modern functionality, ensuring a reliable ride every time. Priced at $599.99, the Electra Townie Original 7D EQ offers an affordable way to experience the joy of cycling without compromising on quality. Electra's dedication to crafting user-friendly bikes shines through with this charming and comfortable ride."
    },
    {
        "id": "27",
        "title": "Surly Big Dummy Frameset - 2017",
        "content": "Embark on your next off-road adventure with the 2017 Surly Big Dummy Frameset. This high-quality mountain bike, falling within the Mountain Bikes category, is expertly crafted to tackle challenging terrains with its robust frameset design. The Surly brand is renowned for its durability and the Big Dummy Frameset is no exception, providing riders with the confidence to take on steep inclines and rugged trails. With a model year of 2017, you can trust in the modern engineering that has gone into this bike. Priced at $999.99, it's a solid investment for cyclists who demand performance and reliability on their mountain biking journeys."
    },
    {
        "id": "28",
        "title": "Karate Monkey 27.5+ Frameset by Surly",
        "content": "Hit the trails with confidence on the 2017 Surly Karate Monkey 27.5+ Frameset. As part of the Mountain Bikes category, this frame is built for the serious mountain biking enthusiast. The Surly brand is renowned for its quality and durability, and this model is no exception. With a model year of 2017, you're getting the latest in mountain bike technology. Priced at $2499.99, this frameset is an investment in top-notch performance and reliability. Take your mountain biking to the next level with the Surly Karate Monkey 27.5+ Frameset."
    },
    {
        "id": "29",
        "title": "Trek X-Caliber 8 - 2017",
        "content": "Hit the trails with confidence on the 2017 Trek X-Caliber 8, a high-performance addition to the Mountain Bikes category. Trek, a brand synonymous with quality and endurance, offers this model as a testament to their commitment to cycling excellence. With its 2017 model year, the X-Caliber 8 is equipped with the latest technology to tackle challenging terrains. Priced at $999.99, it's an investment for serious riders seeking a bike that delivers reliability, comfort, and control on every adventure."
    },
    {
        "id": "30",
        "title": "Surly Ice Cream Truck Frameset - 2017",
        "content": "Hit the trails with confidence on the 2017 Surly Ice Cream Truck Frameset. This premium offering in the Mountain Bikes category is tailored for riders who demand high performance and durability. The 2017 model year is a testament to Surly's commitment to innovation and quality, ensuring that you enjoy a state-of-the-art biking experience. With a list price of $999.99, this frameset provides a solid foundation for building a custom mountain bike that can tackle any adventure."
    },
    {
        "id": "31",
        "title": "Surly Wednesday - 2017",
        "content": "Tackle the rugged trails with the 2017 Surly Wednesday. This high-quality mountain bike, falling under the Mountain Bikes category, is built to endure and conquer diverse terrains from snowy paths to sandy dunes. The Surly Wednesday is recognized for its robust construction and versatile performance, ensuring a smooth ride on even the most challenging landscapes. The model year 2017 reflects its modern design and reliable technology, while the list price of $1632.99 is a fair investment for a premium mountain biking experience. Embark on your next off-road adventure with the durability and excellence of Surly."
    },
    {
        "id": "32",
        "title": "Trek Farley Alloy Frameset - 2017",
        "content": "Hit the trails with confidence on the Trek Farley Alloy Frameset, a 2017 model designed for serious mountain bikers. This premium offering from Trek falls under the Mountain Bikes category and is ideal for riders looking to elevate their off-road experience. The Farley Alloy Frameset features a sturdy and lightweight construction, ensuring both durability and agile handling on challenging terrains. With a model year of 2017, you're equipped with modern features tailored for peak performance. Priced at $469.99, this frameset provides a solid foundation for building your dream mountain bike, backed by Trek's renowned reputation for quality."
    },
    {
        "id": "33",
        "title": "Surly Wednesday Frameset - 2017",
        "content": "Gear up for your mountain biking adventures with the 2017 Surly Wednesday Frameset. This frame, falling under the Mountain Bikes category, is the perfect starting point for riders looking to build a custom bike that can tackle any terrain. Surly is known for its durable and versatile bike frames, and the Wednesday Frameset is no exception. With a model year of 2017, it brings together reliability and modern design. Priced at $469.99, it offers a solid foundation for your dream mountain bike without breaking the bank. Start your build with Surly and experience the thrill of creating and riding your own customized bike."
    },
    {
        "id": "34",
        "title": "Trek Session DH 27.5 Carbon Frameset - 2017",
        "content": "Hit the trails with confidence on the 2017 Trek Session DH 27.5 Carbon Frameset, a top-tier option in the Mountain Bikes category. This high-performance frameset by Trek is engineered for downhill thrills, offering a lightweight yet robust carbon construction. The 2017 model year signifies the latest in mountain biking innovation, allowing you to tackle challenging descents with precision and control. Priced at $469.99, the Trek Session DH 27.5 Carbon Frameset provides exceptional value for riders seeking a premium mountain biking experience. Elevate your mountain biking adventures with Trek's renowned quality and design."
    },
    {
        "id": "35",
        "title": "Spider 3i by Sun Bicycles",
        "content": "Hit the trails with the 2017 Sun Bicycles Spider 3i. Designed for the mountain biking enthusiast, this bike falls under the Mountain Bikes category and is perfect for tackling challenging terrains. The 2017 model year is indicative of its modern features and reliable construction. Priced at $832.99, the Spider 3i offers a balance of quality and affordability. Experience the thrill of the mountains with the durability and innovative design of Sun Bicycles."
    },
    {
        "id": "36",
        "title": "Surly Troll Frameset - 2017",
        "content": "Build your dream mountain bike with the 2017 Surly Troll Frameset. As part of the Mountain Bikes category, this frameset is the perfect starting point for cyclists who want customizability and durability. Surly is renowned for their robust build quality, and this model year 2017 frameset is no exception. It's designed to withstand the rigors of mountain biking, ensuring a reliable and sturdy foundation for your adventures. Priced at $832.99, it's a great investment for anyone serious about crafting their ideal ride. Embrace the trails with the strength and versatility of the Surly Troll Frameset."
    },
    {
        "id": "37",
        "title": "Haro Flightline One ST - 2017",
        "content": "Hit the trails with the 2017 Haro Flightline One ST, a high-performance mountain bike crafted for adventure enthusiasts. Falling under the Mountain Bikes category, this bike is built to endure the rugged demands of off-road cycling. The Haro brand is known for its quality and durability, ensuring that riders tackle challenging terrains with confidence. The 2017 model year reflects the latest in mountain biking technology, ready to deliver a seamless ride. With a list price of $379.99, the Haro Flightline One ST offers a great balance of affordability and reliability for both beginners and seasoned bikers alike."
    },
    {
        "id": "38",
        "title": "Haro Flightline Two 26 Plus - 2017",
        "content": "Hit the trails with confidence on the 2017 Haro Flightline Two 26 Plus, a premium addition to the Mountain Bikes category. This Haro bike is engineered to deliver a superior off-road experience, with a design that accommodates the challenges of rugged landscapes. The model year 2017 is a testament to its modern features and reliability, while the list price of $549.99 ensures you get top-notch quality without breaking the bank. Embrace the thrill of mountain biking with the Haro Flightline Two 26 Plus."
    },
    {
        "id": "39",
        "title": "Trek Stache 5 - 2017",
        "content": "Hit the trails with confidence on the 2017 Trek Stache 5. This high-performing mountain bike falls under the Mountain Bikes category and is perfect for riders looking to tackle challenging terrains. The Stache 5 is built with the quality and durability that Trek is known for, ensuring a smooth and reliable ride. With a model year of 2017, it features up-to-date technology for a superior biking experience. Priced at $1499.99, it offers great value for both amateur and seasoned mountain bikers. Gear up for your next adventure with the Trek Stache 5."
    },
    {
        "id": "40",
        "title": "Trek Fuel EX 9.8 29 - 2017",
        "content": "Hit the trails with confidence on the 2017 Trek Fuel EX 9.8 29, a top-tier mountain bike designed for the serious enthusiast. Part of the esteemed Mountain Bikes category, this bike is engineered to tackle challenging terrain with ease. Its sophisticated design and high-quality components ensure a smooth and stable ride over the most demanding courses. With a model year of 2017, the Trek Fuel EX 9.8 29 incorporates recent advancements in mountain biking technology. Priced at $4999.99, it's an investment in premium performance and durability, reflecting Trek's dedication to excellence in cycling."
    },
    {
        "id": "41",
        "title": "Haro Shift R3 - 2017",
        "content": "Hit the trails with confidence on the 2017 Haro Shift R3. This high-performance mountain bike, falling under the Mountain Bikes category, is designed for riders who seek adventure and challenging terrains. The Shift R3 combines Haro's engineering expertise with a model year of 2017 to deliver a bike that's both reliable and innovative. Priced at $1469.99, it offers exceptional value for cyclists who demand quality and durability. Embrace the mountain biking experience with the Haro Shift R3."
    },
    {
        "id": "42",
        "title": "Trek Fuel EX 5 27.5 Plus",
        "content": "Take your mountain biking to the next level with the 2017 Trek Fuel EX 5 27.5 Plus. This premium mountain bike, falling under the category of Mountain Bikes, is engineered for those who crave adventure and performance on challenging terrains. The model year 2017 is a testament to Trek's continuous innovation, delivering a bike that balances durability and agility. With a list price of $2299.99, the Trek Fuel EX 5 27.5 Plus offers enthusiasts a superior ride that's worth every penny. Embrace the trails with confidence and style with this exceptional offering from Trek."
    },
    {
        "id": "43",
        "title": "Trek Fuel EX 9.8 27.5 Plus - 2017",
        "content": "Take on any trail with confidence on the 2017 Trek Fuel EX 9.8 27.5 Plus. This high-performance mountain bike, nestled in the Mountain Bikes category, is engineered for the thrill-seekers and adventure enthusiasts. With its advanced features and superior build quality, it offers exceptional handling and stability on even the most challenging terrains. The model year 2017 is a testament to the state-of-the-art technology that Trek incorporates into their bikes. At a list price of $5299.99, this bike is an investment in top-tier cycling performance, reflecting Trek's legacy of excellence."
    },
    {
        "id": "44",
        "title": "Haro SR 1.1 - 2017",
        "content": "Hit the trails with confidence on the Haro SR 1.1, a top-notch mountain bike crafted for the thrill-seekers and adventure enthusiasts. This 2017 model from Haro is a standout in the Mountain Bikes category, offering a perfect blend of durability, performance, and affordability. Built to tackle challenging terrains, it features a robust design and agile handling to elevate your riding experience. The Haro SR 1.1 is available at an attractive list price of $539.99, ensuring that you get premium quality without breaking the bank. Embark on your next mountain biking adventure with the reliability and excellence of Haro."
    },
    {
        "id": "45",
        "title": "Haro SR 1.2 by Haro",
        "content": "Tackle the mountain trails with the 2017 Haro SR 1.2. This robust mountain bike, which falls under the Mountain Bikes category, is engineered for the adventurous rider seeking to dominate challenging terrains. Built to endure and designed for performance, the Haro SR 1.2 offers exceptional handling and stability for those steep climbs and rugged descents. The 2017 model year signifies a bike equipped with modern features and technologies, and the list price of $869.99 is a testament to the quality and craftsmanship you can expect from the Haro brand. Gear up for your next off-road journey with the strength and reliability of the Haro SR 1.2."
    },
    {
        "id": "46",
        "title": "Haro SR 1.3 by Haro",
        "content": "Hit the trails with the 2017 Haro SR 1.3. This premium mountain bike, falling under the Mountain Bikes category, is engineered for riders who crave adventure and performance. Its robust construction and agile handling equip you to navigate through challenging terrains effortlessly. The 2017 model year signifies a bike that's built with up-to-date technology, and the list price of $1409.99 reflects the bike's high-quality features and capabilities. Embark on your next mountain biking journey with the assurance of Haro's renowned craftsmanship and durability."
    },
    {
        "id": "47",
        "title": "Trek Remedy 9.8 - 2017",
        "content": "Hit the trails with confidence on the 2017 Trek Remedy 9.8. This high-performance mountain bike, falling under the Mountain Bikes category, is engineered for adventurers seeking to push their limits on challenging terrains. Its robust construction and advanced suspension system provide a smooth ride on even the most demanding trails. The model year 2017 signifies a bike equipped with state-of-the-art features, and the list price of $5299.99 reflects the premium quality and technology you're getting. Embrace the thrill of mountain biking with the exceptional Trek Remedy 9.8."
    },
    {
        "id": "48",
        "title": "Trek Emonda S 4 - 2017",
        "content": "Hit the pavement with speed and agility on the 2017 Trek Emonda S 4. This high-performance road bike, nestled in the Road Bikes category, is engineered for cyclists who demand both top-notch speed and lightweight design. The model year 2017 reflects Trek's dedication to innovation, and with a list price of $1499.99, you're investing in a premium cycling experience. Embrace the thrill of the ride with the Emonda S 4, another testament to Trek's excellence in bike manufacturing."
    },
    {
        "id": "49",
        "title": "Trek Domane SL 6 - 2017",
        "content": "Hit the pavement with the precision and comfort of the 2017 Trek Domane SL 6. This premium road bike, falling under the category of Road Bikes, is engineered for speed, efficiency, and durability. The Trek Domane SL 6 features a design that's perfect for both long-distance rides and quick sprints. With a model year of 2017, it boasts contemporary technology tailored for enthusiastic cyclists. Priced at $3499.99, it's an investment in top-tier cycling performance that reflects Trek's dedication to excellence in the biking world."
    },
    {
        "id": "50",
        "title": "Trek Silque SLR 7 Womens - 2017",
        "content": "Experience the pinnacle of road cycling performance with the 2017 Trek Silque SLR 7 Womens. Designed specifically for the discerning female cyclist, this top-of-the-line road bike falls under the Road Bikes category and is engineered to deliver a blend of speed and comfort on long rides. The model year 2017 is indicative of its modern features and advanced technology that Trek is renowned for. With a list price of $5999.99, the Trek Silque SLR 7 offers premium quality for serious cyclists who demand the best on their journeys."
    },
    {
        "id": "51",
        "title": "Trek Silque SLR 8 Womens - 2017",
        "content": "Experience the pinnacle of road cycling performance with the 2017 Trek Silque SLR 8 Womens. Designed for the discerning female cyclist, this premium road bike falls under the Road Bikes category and is crafted to deliver speed, comfort, and precision handling. The model year 2017 signifies a bike equipped with state-of-the-art features, tailored to enhance your riding experience on both long-distance rides and competitive races. With a list price of $6499.99, the Trek Silque SLR 8 is an investment in top-tier cycling technology and Trek's renowned quality and craftsmanship."
    },
    {
        "id": "52",
        "title": "Surly Steamroller - 2017",
        "content": "Hit the road with confidence on the 2017 Surly Steamroller. Perfectly suited for the Road Bikes category, this bike is designed for cyclists who demand both performance and durability. The Surly brand is known for its quality craftsmanship, and the Steamroller model lives up to that reputation. With a model year of 2017, it incorporates modern features that ensure a smooth and efficient ride on a variety of pavement surfaces. Priced at $875.99, the Surly Steamroller offers a fantastic blend of value and high-end road performance for the serious biking enthusiast."
    },
    {
        "id": "53",
        "title": "Surly Ogre Frameset - 2017",
        "content": "Hit the open road with the 2017 Surly Ogre Frameset. This premium road bike frame, falling under the category of Road Bikes, is engineered for speed, efficiency, and durability. The Surly brand is known for crafting frames that deliver a superior riding experience, and the Ogre Frameset is no exception. With its 2017 model year, you can trust that you're getting the latest in road cycling technology. Priced at $749.99, it offers a solid foundation for building your dream road bike that's tailored to your riding style. Embrace the thrill of the road with the Surly Ogre Frameset."
    },
    {
        "id": "54",
        "title": "Trek Domane SL Disc Frameset - 2017",
        "content": "Hit the pavement with style and performance with the 2017 Trek Domane SL Disc Frameset. This premium road bike frameset falls under the Road Bikes category and is designed for speed, comfort, and efficiency on long rides. Trek's reputation for excellence is evident in the careful construction and design of this frameset. Whether you're an avid racer or an enthusiastic road cyclist, the model year 2017 Domane SL Disc Frameset provides a solid foundation for a top-tier cycling experience. With a list price of $3199.99, it's an investment in your cycling passion that promises to elevate your riding experience."
    },
    {
        "id": "55",
        "title": "Trek Domane S 6 - 2017",
        "content": "Embrace the speed and agility of the 2017 Trek Domane S 6, a premium addition to the Road Bikes category. Engineered for performance and endurance, this sleek road bike by Trek is perfect for both competitive racing and long-distance rides. With its advanced design and a model year of 2017, you can trust in its modern features and capabilities. Priced at $2,699.99, the Trek Domane S 6 offers a blend of luxury and performance that's well worth the investment for serious cyclists seeking to elevate their road biking experience."
    },
    {
        "id": "56",
        "title": "Trek Domane SLR 6 Disc - 2017",
        "content": "Hit the pavement with precision and style on the 2017 Trek Domane SLR 6 Disc. This high-performance road bike, falling under the Road Bikes category, is engineered for speed, comfort, and stability on every ride. Its advanced design and technology are tailored for enthusiasts and professional racers alike. The model year 2017 is a testament to Trek's continuous innovation in the cycling world, and the list price of $5499.99 reflects its premium features and the exceptional quality you're investing in. Embrace your passion for road cycling with the Trek Domane SLR 6 Disc."
    },
    {
        "id": "57",
        "title": "Trek Emonda S 5 - 2017",
        "content": "Hit the pavement with speed and agility on the 2017 Trek Emonda S 5. This high-performance road bike falls under the Road Bikes category and is perfect for cyclists seeking a lightweight yet robust ride. Crafted with precision by Trek, the Emonda S 5 is engineered to deliver a superior road cycling experience. Its 2017 model year is a testament to the latest in cycling innovation, and the list price of $1999.99 reflects the premium quality and advanced features that come with this exceptional bike. Gear up for your next race or enjoy a leisurely ride with the Trek Emonda S 5."
    },
    {
        "id": "58",
        "title": "Trek Madone 9.2 - 2017",
        "content": "Hit the road with power and style on the 2017 Trek Madone 9.2. This high-performance road bike, falling under the Road Bikes category, is engineered for speed, agility, and endurance. With its aerodynamic design and advanced technology, the Madone 9.2 is perfect for competitive cyclists and enthusiasts alike. The model year 2017 reflects its modern features and top-of-the-line specifications. Priced at $4999.99, this bike represents a significant investment in your cycling passion, promising to deliver exceptional performance and speed. Get ready to experience the pinnacle of road cycling with the Trek Madone 9.2."
    },
    {
        "id": "59",
        "title": "Trek Domane S 5 Disc - 2017",
        "content": "Hit the pavement with style and performance on the 2017 Trek Domane S 5 Disc. This premium road bike, falling under the Road Bikes category, is engineered for speed, stability, and endurance on long rides. With its high-quality construction and disc brake system, you'll enjoy a smooth and responsive ride on both city streets and country roads. The model year 2017 reflects a blend of modern features with reliable technology, and the list price of $2599.99 is a testament to the bike's exceptional quality and the value it offers to serious cyclists. Embrace the thrill of the road with the precision and excellence of Trek."
    },
    {
        "id": "60",
        "title": "ElectroLite by Sun Bicycles",
        "content": "Experience the future of cycling with the 2017 Sun Bicycles ElectroLite. As a premier offering in the Electric Bikes category, this innovative bike combines the classic joy of cycling with modern electrical assistance. Crafted for both efficiency and comfort, the ElectroLite makes every journey more enjoyable, whether you're commuting or just taking a leisurely ride. With a model year of 2017, it features up-to-date technology to ensure a smooth and reliable ride. The list price of $1559.99 is a reflection of its quality and advanced features, making the ElectroLite a smart investment for those looking to enhance their cycling experience with the dependable performance of a Sun Bicycles product."
    },
    {
        "id": "61",
        "title": "Trek Powerfly 8 FS Plus - 2017",
        "content": "Elevate your cycling experience with the 2017 Trek Powerfly 8 FS Plus. This high-performance electric bike falls under the Electric Bikes category and is perfect for both adventure enthusiasts and casual riders seeking extra power. The model year 2017 signifies the incorporation of cutting-edge technology, ensuring a smooth and efficient ride. Priced at $4,999.99, the Trek Powerfly 8 FS Plus offers an exceptional blend of quality, durability, and electrified capability, making it a top choice for anyone looking to boost their biking adventures."
    },
    {
        "id": "62",
        "title": "Trek Boone 7 - 2017",
        "content": "Dominate the cyclocross circuit with the 2017 Trek Boone 7. This high-performance cyclocross bike, nestled in the Cyclocross Bicycles category, is engineered for speed, agility, and durability. Built to master muddy courses and spirited rides, it features a lightweight frame and precision handling. With a model year of 2017, the Boone 7 is equipped with modern technology to keep you ahead of the competition. Priced at $3499.99, it stands as a testament to Trek's dedication to top-tier cycling excellence."
    },
    {
        "id": "63",
        "title": "Trek Boone Race Shop Limited - 2017",
        "content": "Dominate the cyclocross circuit with the 2017 Trek Boone Race Shop Limited. This high-performance cyclocross bike, nestled in the Cyclocross Bicycles category, is engineered for speed, agility, and durability. The Boone Race Shop Limited edition comes from a brand synonymous with quality, ensuring that every ride is a testament to Trek's dedication to the sport. The model year 2017 is a promise of the latest advancements in bike technology, and with a list price of $3499.99, you are investing in a top-tier racing machine designed to elevate your competitive edge."
    },
    {
        "id": "64",
        "title": "Electra Townie Original 7D - 2017",
        "content": "Cruise through the city in style with the 2017 Electra Townie Original 7D. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, is perfect for leisurely rides and comfortable commutes. It combines the classic design with modern functionality, ensuring a smooth and enjoyable biking experience. With the model year 2017, you can trust in the reliable performance that Electra is known for. At a list price of $489.99, the Townie Original 7D offers a great balance of comfort, style, and affordability. Make every journey a pleasure with Electra's renowned craftsmanship."
    },
    {
        "id": "65",
        "title": "Lil Bolt Type-R by Sun Bicycles",
        "content": "Cruise in style with the 2017 Sun Bicycles Lil Bolt Type-R. This charming cruiser bicycle, listed under Cruisers Bicycles, offers a comfortable and relaxed riding experience. The 2017 model year combines classic design with modern flair, ensuring you enjoy both the look and the ride. With a list price of $346.99, the Lil Bolt Type-R is an affordable option for those seeking a leisurely bike with the quality assurance of the Sun Bicycles brand."
    },
    {
        "id": "66",
        "title": "Revolutions 24 by Sun Bicycles",
        "content": "Cruise in style with the 2017 Sun Bicycles Revolutions 24. This comfortable cruiser bike falls under the Cruisers Bicycles category and is perfect for leisurely rides around town or by the beach. The 2017 model year reflects a design that prioritizes comfort and ease of use, making it an ideal choice for casual cyclists. With a list price of $250.99, the Revolutions 24 offers an affordable way to enjoy cycling with the quality assurance of Sun Bicycles."
    },
    {
        "id": "67",
        "title": "Revolutions 24 - Girls by Sun Bicycles",
        "content": "Introduce your young adventurer to the joy of cycling with the 2017 Sun Bicycles Revolutions 24 - Girls. This charming cruiser bike, nestled within the Cruisers Bicycles category, offers a comfortable and stylish ride for girls. Crafted with care by Sun Bicycles, it features a relaxed design perfect for leisurely rides along the beach or through the neighborhood. The model year 2017 is indicative of a modern design that still holds its appeal. At an attractive list price of $250.99, this bike promises to deliver endless smiles and memorable experiences on every journey."
    },
    {
        "id": "68",
        "title": "Cruz 3 by Sun Bicycles",
        "content": "Cruise in style with the 2017 Sun Bicycles Cruz 3. This elegant cruiser bike, falling under the Cruisers Bicycles category, offers a perfect blend of comfort and simplicity for leisurely rides and city commutes. Its vintage design and smooth riding experience make it a charming choice for casual cyclists. The model year 2017 reflects Sun Bicycles' dedication to providing quality bikes, and the list price of $449.99 ensures you get a delightful ride without breaking the bank. Embark on a relaxed biking adventure with the Cruz 3 and enjoy every pedal along the way."
    },
    {
        "id": "69",
        "title": "Cruz 7 by Sun Bicycles",
        "content": "Cruise in style with the 2017 Sun Bicycles Cruz 7. As a standout in the Cruisers Bicycles category, this bike offers a smooth and comfortable ride perfect for leisurely weekend jaunts and casual rides along the boardwalk. The 2017 model year combines classic design with contemporary functionality, ensuring a great experience on two wheels. With a list price of $416.99, the Cruz 7 presents an affordable option without compromising on the quality that Sun Bicycles is known for. Enjoy the breeze and the easy-going vibe of cruiser cycling with the Cruz 7."
    },
    {
        "id": "70",
        "title": "Electra Amsterdam Original 3i - 2015/2017",
        "content": "Experience the charm of the city in style with the 2017 Electra Amsterdam Original 3i. This elegant cruiser bicycle falls under the category of Cruisers Bicycles, offering a relaxed and comfortable ride through urban landscapes. The model year 2017 combines classic design with modern features, ensuring a timeless appeal with the convenience of up-to-date mechanics. Priced at $659.99, the Electra Amsterdam Original 3i promises a delightful journey with every pedal. Embrace the essence of city cycling with the sophistication and reliability of Electra."
    },
    {
        "id": "71",
        "title": "Atlas X-Type by Sun Bicycles",
        "content": "Cruise the streets in style with the 2017 Sun Bicycles Atlas X-Type. This elegant cruiser bike, falling under the Cruisers Bicycles category, offers a smooth and comfortable ride for leisurely adventures and urban jaunts. Built with the quality and craftsmanship that Sun Bicycles is known for, it combines a classic design with modern functionality. The model year 2017 means it comes equipped with contemporary features for a reliable performance, and with a list price of $416.99, it presents a great investment for those looking to enjoy relaxed cycling experiences. Enjoy the perfect blend of style and comfort with the Atlas X-Type."
    },
    {
        "id": "72",
        "title": "Biscayne Tandem 7 by Sun Bicycles",
        "content": "Hit the boardwalk or the local bike paths with a companion on the 2017 Sun Bicycles Biscayne Tandem 7. This tandem bike, falling under the Cruisers Bicycles category, provides a comfortable and stylish ride for two. Its 2017 model year ensures modern design and functionality, allowing you and your partner to enjoy a smooth cycling experience together. With a list price of $619.99, the Biscayne Tandem 7 offers a chance to create memorable adventures without breaking the bank. Discover the joy of tandem riding with Sun Bicycles' quality craftsmanship."
    },
    {
        "id": "73",
        "title": "Brickell Tandem 7 by Sun Bicycles",
        "content": "Take a leisurely ride with a companion on the 2017 Sun Bicycles Brickell Tandem 7. This delightful cruiser bike, nestled in the Cruisers Bicycles category, offers a unique tandem experience for two riders. Built by the reputable Sun Bicycles, this model provides a comfortable and stylish journey with its well-crafted frame and relaxed riding position. The 2017 model year brings with it modern features and a smooth ride, all for a list price of $749.99. Enjoy the scenic route and share the joy of cycling with the Brickell Tandem 7."
    },
    {
        "id": "74",
        "title": "Electra Cruiser Lux 1 by Electra",
        "content": "Cruise the streets in style with the 2017 Electra Cruiser Lux 1. This elegant cruiser bike, which falls under the Cruisers Bicycles category, offers a perfect blend of comfort and simplicity for leisurely rides and city commutes. With its classic design and relaxed seating position, you can enjoy a laid-back cycling experience. The model year 2017 is indicative of a modern yet timeless style, and the list price of $439.99 ensures you get premium quality without breaking the bank. Embrace the smooth rides and chic look with Electra's Cruiser Lux 1."
    },
    {
        "id": "75",
        "title": "Electra Cruiser Lux Fat Tire 1 Ladies - 2017",
        "content": "Cruise in style and comfort with the 2017 Electra Cruiser Lux Fat Tire 1 Ladies bike. As part of the Cruisers Bicycles category, this bike is perfect for leisurely rides along the beach or through the park. The wide fat tires offer stability and a smooth ride on various surfaces, making your cycling experience a true pleasure. With Electra's renowned quality and the model year 2017, you're getting a reliable and fashionable ride. The list price of $599.99 ensures that this chic cruiser can be yours without breaking the bank. Embrace the joy of relaxed biking with this Electra cruiser."
    },
    {
        "id": "76",
        "title": "Electra Girls Hawaii 1 16 by Electra",
        "content": "Introduce your little one to the joy of cycling with the 2017 Electra Girls Hawaii 1 16. This charming cruiser bicycle, falling under the category of Cruisers Bicycles, is perfect for young riders looking for style and comfort. The 2017 model year combines contemporary features with a retro design, while the list price of $299.99 makes it an affordable option for parents. With Electra's reputation for quality and a design that captures the essence of a leisurely bike ride, your child is set for endless fun in the sun."
    },
    {
        "id": "77",
        "title": "Electra Glam Punk 3i Ladies - 2017",
        "content": "Make a statement on the streets with the 2017 Electra Glam Punk 3i Ladies bike. This chic cruiser bicycle, falling under the Cruisers Bicycles category, combines style and comfort for the ultimate riding experience. Crafted by Electra, the Glam Punk 3i is perfect for casual jaunts around town with its eye-catching design and smooth performance. The model year 2017 ensures that you're enjoying modern features and design, while the list price of $799.99 is a testament to the quality and craftsmanship you can expect from a brand like Electra. Indulge in the elegance and flair of the Glam Punk 3i Ladies bike and ride with confidence."
    },
    {
        "id": "78",
        "title": "Biscayne Tandem CB by Sun Bicycles",
        "content": "Take leisurely rides and enjoy quality time with a companion on the 2017 Sun Bicycles Biscayne Tandem CB. This delightful cruiser, falling under the Cruisers Bicycles category, offers a unique way to explore scenic routes and beachfronts in tandem. Crafted for comfort and smooth rides, this tandem bicycle is perfect for couples or friends looking for a new shared adventure. With its 2017 model year, you're getting the latest in tandem bike design, and the list price of $647.99 is a fantastic investment for creating lasting memories on the road. Gear up for a tandem experience with Sun Bicycles' dedication to fun and leisure."
    },
    {
        "id": "79",
        "title": "Boardwalk (24-inch Wheels) by Sun Bicycles",
        "content": "Cruise the boardwalk or meander through your neighborhood with the 2017 Sun Bicycles Boardwalk, a bike that's as stylish as it is comfortable. Perfectly placed within the Cruisers Bicycles category, this two-wheeler is ideal for leisurely rides and soaking in the scenery. The 24-inch wheels are just the right size for easy handling and a smooth ride. Built for enjoyment, the Boardwalk model year 2017 combines the timeless design of a cruiser with modern features at an attractive price of $402.99. Ride in style and comfort with Sun Bicycles' dedication to quality and fun."
    },
    {
        "id": "80",
        "title": "Brickell Tandem CB by Sun Bicycles",
        "content": "Enjoy leisurely rides and shared cycling adventures with the 2017 Sun Bicycles Brickell Tandem CB. This stylish cruiser, falling under the Cruisers Bicycles category, is perfect for couples or friends who want to ride together in comfort. The tandem design means twice the fun and half the effort, making it ideal for casual excursions and scenic trips. With a model year of 2017, you can trust its modern features and design, complemented by a list price of $761.99, which is a great investment for a bike that doubles the joy of cycling. Experience the joy of togetherness with Sun Bicycles' commitment to quality and comfort."
    },
    {
        "id": "81",
        "title": "Electra Amsterdam Fashion 7i Ladies - 2017",
        "content": "Cruise the city streets in style with the 2017 Electra Amsterdam Fashion 7i Ladies. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, offers a blend of comfort and chic design for the urban cyclist. With its 2017 model year, you are assured of contemporary features and a sleek appearance. The list price of $1099.99 reflects the quality and craftsmanship that Electra puts into their bikes, ensuring a smooth ride and lasting durability. Make a statement as you ride the Electra Amsterdam Fashion 7i Ladies, a bike that's as fashionable as it is functional."
    },
    {
        "id": "82",
        "title": "Amsterdam Original 3i Ladies by Electra",
        "content": "Cruise through the city with style on the 2017 Electra Amsterdam Original 3i Ladies. This elegant cruiser bicycle, falling under the category of Cruisers Bicycles, is perfect for relaxed rides and comfortable commutes. It combines the classic charm with modern functionality to provide a smooth and delightful cycling experience. The model year 2017 signifies a blend of contemporary design with reliable technology, while the list price of $659.99 offers great value for those looking to enjoy leisurely biking with a touch of sophistication. Embrace the joy of leisure riding with Electra's renowned craftsmanship and flair."
    },
    {
        "id": "83",
        "title": "Trek Boys Kickster - 2015/2017",
        "content": "Introduce your child to the joy of cycling with the 2017 Trek Boys Kickster. This delightful children's bicycle falls under the Children Bicycles category and is perfect for young riders taking their first pedal-free adventures. The model years 2015 and 2017 indicate a proven design that combines fun and safety for kids. Crafted by Trek, a brand synonymous with quality and durability, this bike is priced at just $149.99. It's an investment in your child's active play and mobility, offering the reliability and attention to detail you expect from Trek."
    },
    {
        "id": "84",
        "title": "Lil Kittn by Sun Bicycles",
        "content": "Introduce your child to the joy of cycling with the 2017 Sun Bicycles Lil Kittn. This charming children's bicycle, falling under the Children Bicycles category, is perfect for the young rider in your life. Crafted with care by Sun Bicycles, the Lil Kittn model is designed with a kid-friendly frame and components to ensure a safe and enjoyable ride. The model year 2017 reflects a bicycle that has been tailored for fun and reliability, while the list price of $109.99 makes it an affordable option for families looking to spark a lifelong love of biking. Pedal into precious memories with the Lil Kittn."
    },
    {
        "id": "85",
        "title": "Haro Downtown 16 - 2017",
        "content": "Introduce your kids to the joy of cycling with the 2017 Haro Downtown 16. Perfectly sized for younger riders, this bike falls under the Children Bicycles category and is designed to provide a comfortable and safe riding experience. The Haro brand is known for crafting reliable and stylish bikes, and this model continues that tradition. With a model year of 2017, it features up-to-date design and build-quality, ensuring your little ones are equipped with a dependable bike. Priced at $329.99, the Haro Downtown 16 is an excellent investment in your child's outdoor adventures and physical well-being."
    },
    {
        "id": "86",
        "title": "Trek Girls Kickster - 2017",
        "content": "Introduce your little one to the joys of cycling with the 2017 Trek Girls Kickster. This charming bike falls under the category of Children Bicycles and is perfect for helping young riders build their balance and confidence. Designed by the reputable brand Trek, the Kickster is crafted to fit the needs of growing children with safety and fun in mind. The model year 2017 reflects a design that combines both innovation and reliability. Priced at $149.99, it's an investment in your child's outdoor activities and developmental milestones."
    },
    {
        "id": "87",
        "title": "Trek Precaliber 12 Boys - 2017",
        "content": "Introduce your child to the joy of cycling with the 2017 Trek Precaliber 12 Boys bicycle. As part of the Children Bicycles category, this bike is designed with the needs of young riders in mind. Trek's reputation for quality is evident in the bike's kid-friendly design and ease of use. The model year 2017 reflects a bicycle that's been crafted with attention to detail, ensuring a safe and enjoyable ride for the little ones. Priced at $189.99, the Trek Precaliber 12 Boys bike is an investment in your child's outdoor fun and physical development."
    },
    {
        "id": "88",
        "title": "Trek Precaliber 12 Girls - 2017",
        "content": "Introduce your little one to the joy of cycling with the 2017 Trek Precaliber 12 Girls bike. This charming bicycle, which falls under the category of Children Bicycles, is perfect for young riders embarking on their two-wheeled adventures. Boasting a friendly design and reliable construction by Trek, it's built to provide a safe and enjoyable ride. With a model year of 2017, you can trust that it incorporates modern features tailored for kids' comfort and confidence. Priced at $189.99, the Trek Precaliber 12 Girls bike offers a delightful combination of quality and affordability for the budding cyclist in your family."
    },
    {
        "id": "89",
        "title": "Trek Precaliber 16 Boys - 2017",
        "content": "Introduce your child to the joy of cycling with the 2017 Trek Precaliber 16 Boys. Crafted by the renowned brand Trek, this bicycle falls under the category of Children Bicycles and is perfect for young riders. The model year 2017 signifies a bike built with modern features tailored for kids' comfort and safety. With a list price of $209.99, this bike offers a balance of quality and affordability. The Trek Precaliber 16 Boys is designed to inspire confidence and adventure in every ride."
    },
    {
        "id": "90",
        "title": "Trek Precaliber 16 Girls - 2017",
        "content": "Introduce your little one to the joy of cycling with the 2017 Trek Precaliber 16 Girls bike. Designed with young riders in mind, this bike falls under the Children Bicycles category and is perfect for those first adventures on two wheels. Crafted by the well-known brand Trek, it promises reliability and fun. The bike's model year, 2017, ensures it's equipped with features suitable for kids to learn and enjoy. Priced at $209.99, the Trek Precaliber 16 Girls bike offers great value for a starter bicycle that will create lasting memories."
    },
    {
        "id": "91",
        "title": "Trek Precaliber 24 (21-Speed) - Girls - 2017",
        "content": "Introduce your young adventurer to the joy of cycling with the 2017 Trek Precaliber 24 (21-Speed) - Girls. Tailored for the Children Bicycles category, this bike is perfect for the growing rider. The 21-speed gear system is ideal for giving them the control they need to handle varying terrains, whether on park trails or the neighborhood streets. Crafted with the reliability and reputation of the Trek brand, this model ensures a safe and exciting ride for your child. With a list price of $349.99, it's an investment into countless hours of healthy fun and outdoor activity."
    },
    {
        "id": "92",
        "title": "Haro Shredder 20 - 2017",
        "content": "Introduce your young one to the joy of cycling with the 2017 Haro Shredder 20. Perfectly designed for children and categorized under Children Bicycles, this bike offers a comfortable and safe ride for the budding cyclist. The Haro Shredder 20 is built with a focus on durability to withstand the learning curve and adventures your child will embark on. The model year 2017 brings modern features to this bike, and the list price of $209.99 is a great investment for a high-quality children's bicycle. Let the little riders start their journey on a reliable Haro bike."
    },
    {
        "id": "93",
        "title": "Haro Shredder 20 Girls - 2017",
        "content": "Introduce your little one to the joy of cycling with the 2017 Haro Shredder 20 Girls bike. This delightful ride, nestled in the Children Bicycles category, is perfect for young riders ready to explore their world on two wheels. The Haro Shredder is built with care and precision, ensuring a safe and enjoyable experience for kids. A model year of 2017 reflects a bike equipped with modern features suited for growing cyclists. With a list price of $209.99, this bike offers a fantastic blend of quality and affordability, making it an excellent choice for parents investing in their child's first bicycle. Inspire a lifelong love of biking with the Haro Shredder 20 Girls bike."
    },
    {
        "id": "94",
        "title": "Haro Shredder Pro 20 - 2017",
        "content": "Introduce your child to the joy of cycling with the 2017 Haro Shredder Pro 20. This bike, falling under the category of Children Bicycles, is perfectly sized and designed for young riders. The Haro Shredder Pro 20 offers a comfortable and safe ride, ideal for kids to learn and enjoy biking. Crafted with care by Haro, the model year 2017 promises a combination of durability and fun on wheels. With a list price of $249.99, it's an affordable way to spark a lifelong passion for cycling in your little one. Experience the blend of quality and excitement with Haro's dedication to creating memorable riding experiences."
    },
    {
        "id": "95",
        "title": "Electra Girls Hawaii 1 16 by Electra",
        "content": "Introduce your child to the joy of cycling with the 2017 Electra Girls Hawaii 1 16. This charming bike, belonging to the Children Bicycles category, is perfectly designed for young riders embarking on their two-wheeled adventures. With a stylish design and a size that's just right for kids, this Electra bike promises both comfort and fun. The model year 2017 indicates a bike equipped with kid-friendly features, while the list price of $299.99 ensures you're investing in a quality bike without breaking the bank. Watch your little one pedal off in delight with Electra's commitment to safety and enjoyment."
    },
    {
        "id": "96",
        "title": "Electra Moto 3i (20-inch) - Boys by Electra",
        "content": "Introduce your young adventurer to the joy of cycling with the 2017 Electra Moto 3i (20-inch) for Boys. This dynamic children's bicycle falls under the Children Bicycles category and is designed to deliver a fun and safe riding experience. Tailored for youthful riders, it combines Electra's renowned build quality and style with features suitable for kids. The model year 2017 reflects modern design tailored for youthful enjoyment, while the list price of $349.99 ensures you're getting a fantastic bicycle without breaking the bank. Spark a lifetime of biking enthusiasm with the Electra Moto 3i."
    },
    {
        "id": "97",
        "title": "Electra Savannah 3i (20-inch) - Girls by Electra",
        "content": "Give your young rider the joy of cycling with the 2017 Electra Savannah 3i (20-inch) for girls. This delightful bike falls under the category of Children Bicycles and is perfect for introducing the little ones to the fun of two wheels. Featuring Electra's signature design and reliability, it's built to ensure safety, comfort, and durability for young riders. With a model year of 2017, this bike incorporates modern features tailored for children's use. Priced at $349.99, the Electra Savannah 3i is a great investment for encouraging outdoor play and the development of cycling skills."
    },
    {
        "id": "98",
        "title": "Electra Straight 8 3i (20-inch) - Boys by Electra",
        "content": "Ignite your child's passion for cycling with the 2017 Electra Straight 8 3i, a superb addition to the Children Bicycles category. This bike is specially designed for boys and comes equipped with a 20-inch frame, perfect for young riders. With Electra's renowned quality, the Straight 8 3i promises durability and a smooth riding experience. The model year 2017 ensures that your child benefits from the latest in bicycle design and technology. Priced at $489.99, this bike offers an exceptional combination of style, performance, and value, making it an excellent choice for the young adventurer in your life."
    },
    {
        "id": "99",
        "title": "Electra Sugar Skulls 1 (20-inch) - Girls by Electra",
        "content": "Introduce your little one to the joy of cycling with the 2017 Electra Sugar Skulls 1 (20-inch) - Girls' bicycle. This charming bike falls under the Children Bicycles category and is perfect for young riders ready to explore their neighborhood on two wheels. The colorful Sugar Skulls design is sure to stand out, while the brand Electra guarantees a reliable and fun ride. With a model year of 2017, this bike incorporates modern features tailored for children's comfort and safety. Affordably priced at $299.99, it's an excellent investment for encouraging outdoor play and exercise."
    },
    {
        "id": "100",
        "title": "Electra Townie 3i EQ (20-inch) - Boys by Electra",
        "content": "The 2017 Electra Townie 3i EQ (20-inch) is the perfect ride for young boys who are eager to explore the neighborhood on two wheels. Falling under the category of Children Bicycles, this bike is specifically designed to provide comfort, stability, and safety for the younger cycling enthusiasts. The 2017 model year brings with it the assurance of up-to-date features tailored for kids' enjoyment and ease of use. Priced at $489.99, the Electra Townie 3i EQ offers great value, combining Electra's renowned quality with thoughtful design to create a bike that's both fun and reliable for boys on the move."
    },
    {
        "id": "101",
        "title": "Electra Townie 7D (20-inch) - Boys by Electra",
        "content": "Introduce your child to the joy of cycling with the 2017 Electra Townie 7D (20-inch) for boys. A standout in the Children Bicycles category, this bike is designed to provide a comfortable and safe ride for the young ones. Its 2017 model year reflects Electra's commitment to up-to-date design and innovation, ensuring your child enjoys the latest in bicycle technology. At a list price of $339.99, the Electra Townie 7D offers a fantastic combination of style, durability, and affordability. Give your boy the gift of freedom and fun on two wheels with the quality you can trust from Electra."
    },
    {
        "id": "102",
        "title": "Electra Townie Original 7D - 2017",
        "content": "Experience the perfect blend of comfort and style with the 2017 Electra Townie Original 7D. This elegant comfort bicycle, nestled within the Comfort Bicycles category, offers a relaxed ride ideal for leisurely trips around town or serene jaunts on scenic paths. Its 2017 model year signifies a bike with modern features designed for smooth handling and a pleasurable riding experience. With a list price of $489.99, the Electra Townie Original 7D provides great value for those seeking a bike that combines ease of use with a comfortable posture. Enjoy your rides in comfort and grace with Electra's renowned quality and craftsmanship."
    },
    {
        "id": "103",
        "title": "Streamway 3 by Sun Bicycles",
        "content": "Ride in comfort with the 2017 Sun Bicycles Streamway 3. This stylish comfort bike, falling under the Comfort Bicycles category, offers an enjoyable and smooth cycling experience. It's perfect for casual rides around the neighborhood or leisurely trips through the park. The 2017 model year combines current design with reliable features, and the list price of $551.99 ensures you get a quality bike without breaking the bank. Embrace relaxed cycling with the elegance and ease of the Streamway 3, brought to you by Sun Bicycles."
    },
    {
        "id": "104",
        "title": "Streamway by Sun Bicycles",
        "content": "Ride in comfort with the 2017 Sun Bicycles Streamway. This smooth-riding comfort bike, falling under the Comfort Bicycles category, is perfect for leisurely rides around town or relaxing trips along the boardwalk. Its user-friendly design and inviting style make it a top choice for cyclists who prioritize comfort and ease. The model year 2017 signifies a blend of contemporary features with reliability, and the list price of $481.99 is a competitive rate for a bike that prioritizes your comfort. Get ready to enjoy a serene biking experience with the quality assurance of Sun Bicycles."
    },
    {
        "id": "105",
        "title": "Streamway 7 by Sun Bicycles",
        "content": "Experience the perfect blend of comfort and style with the 2017 Sun Bicycles Streamway 7. This elegant comfort bicycle is designed for leisurely rides and maximum comfort on your journeys. Belonging to the Comfort Bicycles category, it provides a smooth ride, ideal for relaxing trips through the park or around your neighborhood. Crafted by Sun Bicycles, a brand known for their quality and craftsmanship, the Streamway 7 model comes with the assurance of durability. Available for a list price of $533.99, it offers an affordable way to indulge in a cycling experience that doesn't compromise on comfort or class."
    },
    {
        "id": "106",
        "title": "Cruz 3 by Sun Bicycles",
        "content": "Experience the perfect blend of comfort and style with the 2017 Sun Bicycles Cruz 3. This elegant comfort bike, falling under the Comfort Bicycles category, offers a smooth and relaxing ride for leisurely journeys and city cruising. Built with care by Sun Bicycles, the Cruz 3 combines a user-friendly design with a touch of sophistication. The model year 2017 reflects the latest in comfort cycling technology, and with a list price of $449.99, it provides great value for those looking to enjoy cycling with ease and comfort. Make your rides a breeze with the Cruz 3, a testament to Sun Bicycles' dedication to enjoyable cycling experiences."
    },
    {
        "id": "107",
        "title": "Cruz 7 by Sun Bicycles",
        "content": "Experience the perfect blend of comfort and style with the 2017 Sun Bicycles Cruz 7. This leisurely ride falls under the Comfort Bicycles category, offering a smooth and enjoyable cycling experience. Whether you're cruising through the neighborhood or enjoying a weekend ride at the park, the Cruz 7's comfortable design and user-friendly features make it a great companion. With a model year of 2017, you're assured of modern comforts and reliability, while the list price of $416.99 makes it an affordable choice for those seeking quality and ease on two wheels. Discover the joy of riding with Sun Bicycles' dedication to comfort and quality."
    },
    {
        "id": "108",
        "title": "Cruz 3 - Women's by Sun Bicycles",
        "content": "Embark on a journey of comfort and style with the 2017 Sun Bicycles Cruz 3 - Women's. This elegant comfort bike, nestled in the Comfort Bicycles category, is perfect for the leisure rider who values both form and function. The 2017 model year blends modern design with time-honored comfort, ensuring a smooth ride on city streets or park paths. Priced at $449.99, the Cruz 3 offers affordability without compromising on the quality that Sun Bicycles is known for. Cruise in comfort and enjoy the ride with Sun Bicycles' dedication to a great cycling experience."
    },
    {
        "id": "109",
        "title": "Cruz 7 - Women's by Sun Bicycles",
        "content": "Experience a smooth and comfortable ride with the 2017 Sun Bicycles Cruz 7 - Women's. This elegant comfort bicycle, falling under the Comfort Bicycles category, offers a relaxing cycling experience for leisurely rides and daily commutes. It combines the reliable quality of Sun Bicycles with a design tailored for women's comfort. The model year 2017 signifies a modern design with features that prioritize ease of use and rider enjoyment. Priced at $416.99, the Cruz 7 represents a smart investment for those seeking comfort and style in their cycling adventures. Embrace the joy of riding with Sun Bicycles' dedication to comfort and quality."
    },
    {
        "id": "110",
        "title": "Drifter 7 by Sun Bicycles",
        "content": "Experience a blend of comfort and style with the 2017 Sun Bicycles Drifter 7. Designed for the Comfort Bicycles category, this bike is perfect for riders seeking a relaxed and enjoyable ride. The Drifter 7 offers a unique combination of smooth-riding performance and thoughtful design, suited for leisurely trips around town or cruising on gentle terrains. With a model year of 2017, it incorporates contemporary features for a satisfying cycling experience. Priced at $470.99, the Sun Bicycles Drifter 7 presents a great opportunity for those looking for a quality comfort bike without breaking the bank. Enjoy the journey with the reliability and comfort that Sun Bicycles is known for."
    },
    {
        "id": "111",
        "title": "Drifter 7 - Women's by Sun Bicycles",
        "content": "Experience the perfect blend of comfort and style with the 2017 Sun Bicycles Drifter 7, specially designed for women. This elegant comfort bicycle, falling under the Comfort Bicycles category, offers a smooth and relaxing ride ideal for leisurely weekend jaunts and daily commutes alike. Its model year 2017 stands for modern design and reliable performance. Priced at $470.99, the Drifter 7 provides a great value for cyclists looking for a quality bike with a touch of luxury. Enjoy your ride in comfort and confidence with Sun Bicycles' dedication to rider satisfaction."
    },
    {
        "id": "112",
        "title": "Trek 820 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek 820, a versatile mountain bike designed for adventurers and thrill-seekers alike. As part of the Mountain Bikes category, the Trek 820 is built to tackle challenging terrain, ensuring a smooth and enjoyable ride. With its 2018 model year, you can trust in the modern design and technology that make this bike a reliable companion for your off-road excursions. Priced at $379.99, the Trek 820 offers outstanding performance and quality at a competitive price point. Embark on your next mountain biking journey with the exceptional Trek 820."
    },
    {
        "id": "113",
        "title": "Trek Marlin 5 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek Marlin 5, a top-performer in the Mountain Bikes category. Designed for the adventure enthusiast, this bike is built by Trek, a brand synonymous with quality and durability. The Marlin 5 model is equipped to tackle challenging terrains, ensuring a thrilling ride every time. With a model year of 2018, you can trust that you're getting the latest in cycling innovation at a competitive list price of $489.99. Gear up for your next mountain biking adventure with the Trek Marlin 5."
    },
    {
        "id": "114",
        "title": "Trek Marlin 6 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek Marlin 6. This high-performance mountain bike, which falls under the Mountain Bikes category, is engineered for adventurers and thrill-seekers alike. The Marlin 6 features a robust frame and agile handling to navigate through challenging terrains with precision. With a model year of 2018, it boasts current technology tailored for durability and comfort. Priced at $579.99, the Trek Marlin 6 offers a remarkable blend of quality and affordability, ensuring you experience top-notch riding without breaking the bank. Embrace the mountains with the reliability of Trek."
    },
    {
        "id": "115",
        "title": "Trek Fuel EX 8 29 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek Fuel EX 8 29, a premium offering in the Mountain Bikes category. This model combines Trek's renowned design with the latest in biking technology for a smooth, powerful ride. Whether navigating technical descents or powering up climbs, you'll appreciate the bike's precision and control. Boasting a model year of 2018, it's a contemporary choice for serious cyclists, and the list price of $3199.99 reflects its high-end status. Embrace your adventurous spirit with the Trek Fuel EX 8 29 and elevate your mountain biking experience."
    },
    {
        "id": "116",
        "title": "Trek Marlin 7 - 2017/2018",
        "content": "Hit the trails with confidence on the Trek Marlin 7, a superior mountain bike designed for the thrill-seekers and adventure enthusiasts. This bike falls under the Mountain Bikes category, offering a perfect blend of durability and performance for the model year 2018. Trek's commitment to quality is evident in every aspect of the Marlin 7, providing a smooth ride on even the most challenging terrains. Priced at $749.99, it represents a smart investment for those looking to elevate their mountain biking experience with a reliable and well-crafted machine."
    },
    {
        "id": "117",
        "title": "Trek Ticket S Frame - 2018",
        "content": "Hit the trails with confidence on the Trek Ticket S Frame, a premium offering in the Mountain Bikes category for the 2018 model year. Trek, a brand synonymous with quality and innovation, brings you a frame that's built for performance and precision. Whether you're an avid mountain biker or a competitive racer, this frame provides a solid foundation for a top-tier build. With a list price of $1469.99, the Trek Ticket S Frame is an investment in your passion for mountain biking that promises durability and an exceptional riding experience."
    },
    {
        "id": "118",
        "title": "Trek X-Caliber 8 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek X-Caliber 8. Designed for the mountain biking enthusiast, this bike is a standout in the Mountain Bikes category. It offers a perfect blend of performance, durability, and precision handling to tackle challenging terrains and elevate your riding experience. With a model year of 2018, you benefit from the latest advancements in mountain biking technology. The list price of $999.99 is a testament to the quality and craftsmanship that Trek is known for. Embrace the thrill of mountain biking with the Trek X-Caliber 8."
    },
    {
        "id": "119",
        "title": "Trek Kids Neko - 2018",
        "content": "Introduce your little ones to the joy of mountain biking with the 2018 Trek Kids Neko. This kid-friendly bike, part of the Mountain Bikes category, is perfect for young adventurers eager to explore off-road trails. Boasting the quality craftsmanship of Trek, this bike is built to withstand the energy and enthusiasm of children while ensuring a safe and comfortable ride. With a model year of 2018, it features up-to-date design and technology for a smooth experience. The list price of $469.99 makes it a great investment for introducing the thrill of mountain biking to the next generation."
    },
    {
        "id": "120",
        "title": "Trek Fuel EX 7 29 - 2018",
        "content": "Take on challenging trails with the Trek Fuel EX 7 29 - 2018. This high-performance mountain bike, falling under the category of Mountain Bikes, is engineered for adventurers and thrill-seekers alike. The 2018 model year combines modern innovation with reliable craftsmanship, ensuring a ride that's as smooth as it is exciting. Featuring top-tier components and a list price of $2499.99, the Trek Fuel EX 7 29 is a premium choice for riders seeking quality and endurance in their mountain biking experiences."
    },
    {
        "id": "121",
        "title": "Surly Krampus Frameset - 2018",
        "content": "Hit the trails with the 2018 Surly Krampus Frameset, a premium offering in the Mountain Bikes category. This frameset is the perfect foundation for riders looking to build a custom mountain bike tailored to their adventurous spirit. Crafted by Surly, a brand renowned for quality and durability, the Krampus Frameset is designed to navigate through challenging landscapes with precision. The 2018 model year ensures you benefit from the latest in mountain biking technology, and with a list price of $2499.99, it's an investment in unparalleled performance and individuality on the mountain trails."
    },
    {
        "id": "122",
        "title": "Surly Troll Frameset - 2018",
        "content": "Build your dream off-road machine with the 2018 Surly Troll Frameset. This exceptional frameset is the perfect starting point for customizing your mountain bike, nestled in the Mountain Bikes category. Surly is known for its quality and durability, and the Troll Frameset is no exception. It's designed to tackle challenging terrains, ensuring a solid foundation for all your mountain biking adventures. With a model year of 2018, it incorporates modern design with a touch of ruggedness. The list price of $2499.99 reflects its premium status and Surly's commitment to excellence. Embark on your next trail with the confidence that comes from a top-tier Surly frameset."
    },
    {
        "id": "123",
        "title": "Trek Farley Carbon Frameset - 2018",
        "content": "Take your mountain biking to new heights with the 2018 Trek Farley Carbon Frameset. As a premium offering in the Mountain Bikes category, this frameset is the perfect foundation for a top-tier build. The lightweight yet robust carbon structure provides exceptional responsiveness and control on diverse terrains. Whether you're tackling snow, sand, or rocky trails, the Farley Carbon Frameset is engineered to deliver peak performance. With a model year of 2018, you're getting the latest in cycling innovation from Trek, a brand synonymous with quality. The list price of $999.99 is a testament to the craftsmanship and advanced features this frameset has to offer. Gear up for an unparalleled riding experience with Trek's Farley Carbon Frameset."
    },
    {
        "id": "124",
        "title": "Surly Krampus - 2018",
        "content": "Hit the trails with confidence on the 2018 Surly Krampus, a top-tier mountain bike designed for the thrill-seekers and off-road adventurers. As part of the Mountain Bikes category, the Surly Krampus is built to endure the most challenging terrain, from rocky inclines to muddy tracks. The 2018 model year incorporates modern features and robust construction, ensuring reliability and top performance. Priced at $1,499.00, this bike offers the quality and durability that Surly is known for. Embark on your next mountain biking journey with the exceptional Surly Krampus."
    },
    {
        "id": "125",
        "title": "Trek Kids Dual Sport - 2018",
        "content": "Introduce your young adventurers to the joys of off-road biking with the 2018 Trek Kids Dual Sport. Perfectly categorized under Mountain Bikes, this bike is tailored for the energetic spirit of children who yearn for outdoor escapades. Crafted by the renowned brand Trek, it promises durability and comfort in a package that's just right for the younger crowd. The 2018 model year reflects a bike that's equipped with modern features to ensure a safe and thrilling ride. Priced at $469.99, it offers an affordable entry into the world of mountain biking without compromising on quality. Gear up for memorable family trails with the Trek Kids Dual Sport."
    },
    {
        "id": "126",
        "title": "Surly Big Fat Dummy Frameset - 2018",
        "content": "Take your mountain biking to the next level with the 2018 Surly Big Fat Dummy Frameset. This premium offering in the Mountain Bikes category is engineered to provide an unparalleled riding experience on any terrain. The robust frameset is the perfect foundation for building a custom bike that meets all your adventurous needs. With a model year of 2018, you can trust in the modern design and features that Surly is known for. Priced at $469.99, the Surly Big Fat Dummy Frameset offers exceptional value for cyclists who demand quality and versatility in their rides. Embrace the trails with the reliability and craftsmanship of Surly."
    },
    {
        "id": "127",
        "title": "Surly Pack Rat Frameset - 2018",
        "content": "Embark on your next off-road adventure with the 2018 Surly Pack Rat Frameset. This versatile mountain bike, part of the Mountain Bikes category, is designed to tackle challenging terrains with resilience. Crafted by Surly, a brand known for its durable and reliable bikes, the Pack Rat Frameset features a robust build and agile handling for navigating through rough trails. The 2018 model year brings with it the assurance of modern technology tailored for mountain biking enthusiasts. Priced at $469.99, it offers a great balance between cost and quality for riders looking to elevate their mountain biking experience."
    },
    {
        "id": "128",
        "title": "Surly ECR 27.5 - 2018",
        "content": "Embark on your next off-road adventure with the 2018 Surly ECR 27.5. This robust mountain bike falls within the Mountain Bikes category and is specifically designed to tackle challenging landscapes with ease. Crafted for durability and precise control, the Surly ECR 27.5 ensures that you'll navigate through rugged trails and steep inclines with confidence. The model year 2018 reflects a commitment to innovation and reliability, while the list price of $1899.00 signifies a premium investment in top-tier biking performance. Embrace the thrill of the mountains with the unparalleled quality and craftsmanship of Surly."
    },
    {
        "id": "129",
        "title": "Trek X-Caliber 7 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek X-Caliber 7, a top-tier mountain bike designed for the serious enthusiast. Belonging to the prestigious category of Mountain Bikes, this model is engineered to tackle challenging terrains with its superior craftsmanship and robust design. The year 2018 signifies the cutting-edge technology that supports its high performance, making it a reliable choice for adventurers. With a list price of $919.99, the Trek X-Caliber 7 offers exceptional value for riders looking for a high-quality mountain biking experience backed by the renowned Trek brand."
    },
    {
        "id": "130",
        "title": "Trek Stache Carbon Frameset - 2018",
        "content": "Unleash your potential on the trails with the 2018 Trek Stache Carbon Frameset. This high-performance mountain bike, falling under the Mountain Bikes category, is engineered for cyclists who demand the best in speed, stability, and endurance. Crafted by the renowned brand Trek, the Stache Carbon Frameset features a lightweight yet robust design to tackle diverse landscapes with agility. The model year 2018 is indicative of a modern geometry and advanced materials, ensuring a top-notch riding experience. With a list price of $919.99, this frameset is an investment in your riding passion, combining Trek's legendary quality with the thrill of mountain biking."
    },
    {
        "id": "131",
        "title": "Heller Bloodhound Trail - 2018",
        "content": "Hit the rugged trails with confidence on the 2018 Heller Bloodhound Trail. This premium mountain bike falls under the Mountain Bikes category and is built to tackle challenging terrains with ease. Its robust construction and agile handling equip you for adventure on steep inclines and technical trails. The 2018 model year reflects a bike equipped with modern technology and design, ready to deliver an exhilarating ride. With a list price of $2,599.00, the Heller Bloodhound Trail offers outstanding performance and quality for serious mountain biking enthusiasts."
    },
    {
        "id": "132",
        "title": "Trek Procal AL Frameset - 2018",
        "content": "Take your mountain biking to the next level with the 2018 Trek Procal AL Frameset. This premium offering from Trek falls under the Mountain Bikes category, promising to deliver an exceptional riding experience. The Procal AL Frameset is renowned for its lightweight yet robust construction, making it ideal for tackling challenging terrains and elevations. With a model year of 2018, you can trust in the up-to-date design and technology that goes into this bike. At a list price of $1499.99, it represents a wise investment for serious bikers seeking performance and durability."
    },
    {
        "id": "133",
        "title": "Trek Procaliber Frameset - 2018",
        "content": "Build your dream ride with the 2018 Trek Procaliber Frameset. A masterpiece in the Mountain Bikes category, this frameset is the ultimate starting point for cyclists who demand precision and performance on the trails. Crafted by the renowned brand Trek, it offers a superb blend of durability and lightweight design for peak efficiency. The model year 2018 is a testament to Trek's commitment to innovation, while the list price of $1499.99 assures you're investing in top-tier quality for a serious mountain biking experience."
    },
    {
        "id": "134",
        "title": "Trek Remedy 27.5 C Frameset - 2018",
        "content": "Hit the trails with precision and agility on the 2018 Trek Remedy 27.5 C Frameset. This high-performance mountain bike, falling under the Mountain Bikes category, is engineered for those who seek the thrill of rugged terrains and challenging landscapes. Crafted by the renowned brand Trek, this frameset is the foundation for a custom build that can tackle steep descents and technical trails. The 2018 model year is a testament to its modern design and advanced features, ensuring you're equipped with the latest in mountain biking technology. Priced at $1499.99, the Trek Remedy 27.5 C Frameset offers a premium biking experience for enthusiasts ready to push their limits."
    },
    {
        "id": "135",
        "title": "Trek X-Caliber Frameset - 2018",
        "content": "Build your dream ride with the 2018 Trek X-Caliber Frameset, a premium foundation for high-performance mountain bikes. As part of the Mountain Bikes category, this frameset promises a custom experience for cycling enthusiasts. The 2018 model year ensures you're benefiting from the latest advances in frame technology, while the list price of $1499.99 is a testament to the quality and craftsmanship you can expect from the renowned brand Trek. Embark on your next off-road adventure with a bike that's designed to your specifications."
    },
    {
        "id": "136",
        "title": "Trek Procaliber 6 - 2018",
        "content": "Take on challenging trails with the 2018 Trek Procaliber 6. This high-performance mountain bike, falling under the Mountain Bikes category, is engineered for speed, stability, and endurance. The Procaliber 6 model boasts a lightweight frame and advanced features that cater to both competitive cyclists and adventure enthusiasts alike. With a model year of 2018, riders will benefit from recent innovations in mountain biking technology. Priced at $1799.99, the Trek Procaliber 6 represents a significant investment in your off-road cycling adventures, offering premium quality and exceptional riding experiences."
    },
    {
        "id": "137",
        "title": "Heller Shagamaw GX1 - 2018",
        "content": "Hit the trails with the 2018 Heller Shagamaw GX1, a high-performance addition to the Mountain Bikes category. Heller has engineered this bike to tackle the most challenging off-road conditions with ease. The Shagamaw GX1's superior design and robust construction ensure that you can navigate rocky inclines and technical descents with confidence. With a model year of 2018, you're equipped with the latest advancements in mountain biking technology. At a list price of $2599.00, this bike offers the quality and endurance that serious mountain bikers demand. Experience the thrill of mountain biking at its finest with the Heller Shagamaw GX1."
    },
    {
        "id": "138",
        "title": "Trek Fuel EX 5 Plus - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek Fuel EX 5 Plus. This premium mountain bike, falling under the Mountain Bikes category, is engineered for those who crave adventure and performance. Its robust construction and advanced suspension system allow you to tackle challenging terrains with ease. With a model year of 2018, you can trust that you're getting the latest in trail-riding technology. Priced at $2,249.99, the Trek Fuel EX 5 Plus offers exceptional quality and durability, ensuring a thrilling yet reliable ride every time."
    },
    {
        "id": "139",
        "title": "Trek Remedy 7 27.5 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek Remedy 7 27.5. As part of the Mountain Bikes category, this high-performance bike is crafted by Trek, a brand synonymous with quality and innovation in the cycling world. The 27.5-inch wheels are perfect for maneuvering through challenging mountain terrain, ensuring a smooth and stable ride. With a model year of 2018, you're equipped with the latest in mountain biking technology. Priced at $2999.99, the Trek Remedy 7 27.5 represents a smart investment for serious mountain bikers seeking adventure and reliability."
    },
    {
        "id": "140",
        "title": "Trek Remedy 9.8 27.5 - 2018",
        "content": "Tackle challenging trails and enjoy the thrill of mountain biking with the 2018 Trek Remedy 9.8 27.5. Positioned in the Mountain Bikes category, this high-performance bike is engineered to provide a superior off-road experience. Its cutting-edge design and top-tier components ensure that you can navigate through rugged landscapes with agility and confidence. Crafted by Trek, a brand synonymous with quality and innovation, the model year 2018 marks a pinnacle of development in mountain biking technology. With a list price of $4999.99, the Trek Remedy 9.8 27.5 is an investment in both adventure and reliability for serious mountain biking enthusiasts."
    },
    {
        "id": "141",
        "title": "Trek Stache 5 - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek Stache 5. This high-quality mountain bike falls under the Mountain Bikes category and is engineered for adventure seekers and trail enthusiasts. The Stache 5 is equipped with features that ensure durability and performance on the most challenging terrains. Its model year of 2018 signifies that you're getting the latest in mountain biking technology. Priced at $1599.99, the Trek Stache 5 offers a premium biking experience for those looking to push their limits and enjoy the thrills of the great outdoors."
    },
    {
        "id": "142",
        "title": "Trek Fuel EX 8 29 XT - 2018",
        "content": "Hit the trails with confidence on the 2018 Trek Fuel EX 8 29 XT, a top-tier mountain bike designed for the thrill-seekers and adventure enthusiasts. As part of the esteemed Mountain Bikes category, this bike features state-of-the-art technology to deliver a smooth, responsive ride on even the most challenging terrains. Built to endure with the quality craftsmanship expected from the Trek brand, the Fuel EX 8 29 XT model boasts a robust frame and high-performance components. With a list price of $3199.99, this bike is a premium choice for cyclists who demand the best in off-road performance."
    },
    {
        "id": "143",
        "title": "Trek Domane ALR 3 - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane ALR 3. This premium road bike, falling under the Road Bikes category, is engineered for speed, comfort, and efficiency on all your pavement pursuits. Boasting a lightweight frame and top-notch handling, the Domane ALR 3 makes long rides more enjoyable and sprinting to the finish exhilarating. With a model year of 2018, you can trust that you're riding the latest in road cycling technology. Priced at $1099.99, the Trek Domane ALR 3 is an excellent investment for cyclists who demand quality and performance on the road."
    },
    {
        "id": "144",
        "title": "Trek Domane ALR 4 Disc - 2018",
        "content": "Hit the road with precision and style on the 2018 Trek Domane ALR 4 Disc. This premium road bike, falling under the Road Bikes category, is engineered for both speed and comfort. Whether you're tackling long distance rides or sprinting on local routes, the Domane ALR 4 Disc provides a smooth and reliable experience. The model year 2018 embodies the latest in cycling innovation from Trek, and with a list price of $1549.99, it offers competitive value for cyclists seeking top-tier performance and quality."
    },
    {
        "id": "145",
        "title": "Trek Domane ALR 5 Disc - 2018",
        "content": "Hit the pavement with the sleek and high-performance 2018 Trek Domane ALR 5 Disc. This top-tier road bike, part of the Road Bikes category, is engineered for speed, comfort, and efficiency on all your asphalt adventures. Its lightweight frame and advanced disc braking system provide the perfect combination for endurance rides and competitive racing. The model year 2018 is indicative of its modern design and features, ensuring you're equipped with the latest in cycling technology. At a list price of $1799.99, the Trek Domane ALR 5 Disc offers a premium experience for serious cyclists who demand the best."
    },
    {
        "id": "146",
        "title": "Trek Domane SLR 6 - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane SLR 6. This premium road bike, falling under the Road Bikes category, is engineered for speed, comfort, and efficiency on long rides. The Domane SLR 6 model boasts a sophisticated design and top-tier components, making it a favorite among cycling enthusiasts. With a model year of 2018, it features the latest in cycling technology that Trek is renowned for. Priced at $4999.99, it's an investment in unparalleled road biking excellence for serious riders who demand the best."
    },
    {
        "id": "147",
        "title": "Trek Domane ALR 5 Gravel - 2018",
        "content": "Hit the road with confidence on the 2018 Trek Domane ALR 5 Gravel. This premium road bike, falling under the Road Bikes category, is engineered for both endurance and efficiency. The Domane ALR 5 Gravel is built for those who demand a blend of comfort and speed for long rides over varied terrain. With a model year of 2018, you can trust in its modern design and features, all offered at a list price of $1799.99. Whether you're tackling gravel paths or smooth pavements, Trek's reputation for reliability and top-notch performance is evident in every pedal stroke."
    },
    {
        "id": "148",
        "title": "Trek Domane SL 8 Disc - 2018",
        "content": "Hit the pavement with speed and style on the 2018 Trek Domane SL 8 Disc. As part of the Road Bikes category, this premium bicycle is engineered for enthusiasts and professionals alike, offering a superior ride on tarmac terrains. The model year 2018 is a testament to Trek's ongoing innovation in cycling technology, while the list price of $5499.99 reflects the high-quality components and advanced features that come with this top-tier road bike. Experience the thrill of road cycling with the precision and comfort of the Trek Domane SL 8 Disc."
    },
    {
        "id": "149",
        "title": "Trek Domane SLR 8 Disc - 2018",
        "content": "Hit the open road with the 2018 Trek Domane SLR 8 Disc. This premium road bike, falling under the Road Bikes category, is crafted for speed, comfort, and efficiency. Its advanced disc brake system provides reliable stopping power in all conditions, making it a top choice for serious cyclists. The model year 2018 signifies a bike equipped with the latest in cycling technology, and the list price of $7499.99 is indicative of its high-end components and Trek's reputation for excellence. Elevate your road cycling experience with the Domane SLR 8 Disc."
    },
    {
        "id": "150",
        "title": "Trek Emonda SL 7 - 2018",
        "content": "Elevate your road cycling experience with the 2018 Trek Emonda SL 7. This high-performance road bike falls under the Road Bikes category and is engineered for speed, agility, and endurance. The Trek Emonda SL 7 is built to deliver a superior ride on both long-distance tours and high-velocity sprints. With a model year of 2018, it boasts recent advancements in cycling technology. The list price of $4499.99 reflects its premium features and Trek's reputation for crafting exceptional cycling machines. Get ready to push your limits and glide over the pavement with the Emonda SL 7."
    },
    {
        "id": "151",
        "title": "Trek Domane ALR 4 Disc Womens - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane ALR 4 Disc Women's road bike. Designed specifically for the road biking enthusiast, this elegant model falls within the Road Bikes category, offering a perfect blend of speed and comfort. The 2018 model year ensures you benefit from the latest advancements in bike design and technology, while the list price of $1549.99 is a testament to its premium quality and craftsmanship. Experience the joy of road cycling with the precision and reliability that comes with the Trek brand."
    },
    {
        "id": "152",
        "title": "Trek Domane SL 5 Disc Women's - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane SL 5 Disc Women's road bike. This top-tier road bike falls under the Road Bikes category and is tailor-made for those who demand speed, comfort, and reliability in their cycling endeavors. Crafted by the renowned brand Trek, it features a cutting-edge design that provides a smooth ride even on the most challenging roads. The model year 2018 is a testament to its modern features and enhancements, while the list price of $2499.99 is a reflection of its premium quality and advanced technology. Elevate your road biking experience with the Trek Domane SL 5 Disc Women's."
    },
    {
        "id": "153",
        "title": "Trek Domane SL 7 Womens - 2018",
        "content": "Hit the road with confidence on the 2018 Trek Domane SL 7 Womens. This premium road bike, positioned in the Road Bikes category, is engineered for speed, comfort, and efficiency. The innovative design and advanced materials provide a smooth ride for long distances. With a model year of 2018, it incorporates recent advancements in cycling technology. Priced at $4,999.99, the Trek Domane SL 7 offers a fantastic blend of performance and luxury for the serious female cyclist."
    },
    {
        "id": "154",
        "title": "Trek Domane SLR 6 Disc Women's - 2018",
        "content": "Hit the road with the precision and comfort of the 2018 Trek Domane SLR 6 Disc Women's. This high-performance road bike, falling under the Road Bikes category, is engineered specifically for the avid female cyclist. With its advanced disc brake system, you'll experience exceptional stopping power and control in all weather conditions. The model year 2018 is a testament to Trek's continuous innovation in cycling technology. Priced at $5499.99, the Trek Domane SLR 6 Disc Women's offers a premium cycling experience for those who demand the best."
    },
    {
        "id": "155",
        "title": "Trek Domane SLR 9 Disc - 2018",
        "content": "Hit the road with unparalleled style and performance with the 2018 Trek Domane SLR 9 Disc. This top-tier road bike, falling under the category of Road Bikes, is engineered for speed, stability, and comfort on long rides and competitive races. Boasting a model year of 2018, it features advanced technology that caters to serious cyclists seeking premium features. With a list price of $11,999.99, the Trek Domane SLR 9 Disc is an investment in your cycling passion, offering the very best of Trek's design and innovation."
    },
    {
        "id": "156",
        "title": "Trek Domane SL Frameset - 2018",
        "content": "Hit the pavement with style and performance with the 2018 Trek Domane SL Frameset. This premium road bike, falling under the Road Bikes category, is engineered for speed, comfort, and efficiency. The Domane SL Frameset is a testament to Trek's dedication to cutting-edge cycling technology and design, perfect for both competitive and casual riders. With a model year of 2018, you're getting the latest innovations in bike construction. The list price of $6499.99 is a reflection of the quality and advanced features packed into this exceptional frameset. Embrace the speed of the road with Trek's Domane SL Frameset."
    },
    {
        "id": "157",
        "title": "Trek Domane SL Frameset Women's - 2018",
        "content": "Experience the perfect blend of speed and comfort with the 2018 Trek Domane SL Frameset Women's. A premium offering in the Road Bikes category, this frameset is engineered for serious cyclists who demand top performance on long rides. The model year 2018 is a testament to Trek's continuous innovation in cycling technology, ensuring that you ride with the latest advancements. With a list price of $6499.99, the Trek Domane SL Frameset is an investment in your cycling passion, providing unmatched quality and a tailored fit for women riders. Dominate the roads with the elegance and endurance of Trek's craftsmanship."
    },
    {
        "id": "158",
        "title": "Trek CrossRip 1 - 2018",
        "content": "Hit the road with precision and style on the 2018 Trek CrossRip 1. This premium Road Bike from Trek is engineered for both speed and comfort, making it an excellent choice for enthusiasts and regular commuters alike. The 2018 model year brings the latest in cycling technology to the forefront, ensuring a smooth and efficient ride. Priced at $959.99, the Trek CrossRip 1 offers a fantastic blend of performance and value, making it a must-have for any serious road biker. Gear up and experience the thrill of the open road with this exceptional Trek creation."
    },
    {
        "id": "159",
        "title": "Trek Emonda ALR 6 - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Emonda ALR 6. Crafted for speed and efficiency, this road bike falls under the category of Road Bikes, perfect for both competitive racing and everyday cycling. The Emonda ALR 6 is engineered by Trek, a brand synonymous with quality and innovation in the cycling world. With a model year of 2018, you're equipped with the latest advancements in road bike technology. Priced at $2299.99, the Trek Emonda ALR 6 offers a premium cycling experience for serious enthusiasts looking to elevate their ride."
    },
    {
        "id": "160",
        "title": "Trek Emonda SLR 6 - 2018",
        "content": "Hit the pavement with speed and agility on the 2018 Trek Emonda SLR 6. This high-performance road bike, falling under the Road Bikes category, is engineered for cyclists who demand the best in speed, weight, and handling. The Emonda SLR 6 boasts an ultralight frame and aerodynamic design, ensuring you'll slice through the wind with ease. With a model year of 2018, you're getting the latest advancements in road cycling technology. Priced at $4499.99, the Trek Emonda SLR 6 offers a premium cycling experience for serious enthusiasts and racers alike. Embrace the road ahead with Trek's dedication to excellence."
    },
    {
        "id": "161",
        "title": "Surly ECR - 2018",
        "content": "Hit the open road with the 2018 Surly ECR. This premium road bike, falling under the Road Bikes category, is built for speed, efficiency, and endurance. Whether you're commuting to work or embarking on a long-distance tour, the Surly ECR is engineered to deliver a smooth and reliable ride. The model year 2018 is indicative of its modern features and design, while the list price of $1899.00 reflects its high-quality components and craftsmanship. Gear up for your next road adventure with the exceptional performance of the Surly ECR."
    },
    {
        "id": "162",
        "title": "Trek Emonda SL 6 Disc - 2018",
        "content": "Hit the pavement with precision and speed on the 2018 Trek Emonda SL 6 Disc. This high-performance road bike, falling under the category of Road Bikes, is engineered for avid cyclists who demand both quality and performance. Crafted by the reputable brand Trek, this model boasts a lightweight design and advanced disc brake technology for unparalleled control and efficiency. The model year 2018 is a testament to its cutting-edge features, and with a list price of $2999.99, it represents a premium choice for those who take their road cycling seriously. Elevate your road biking experience with the Trek Emonda SL 6 Disc."
    },
    {
        "id": "163",
        "title": "Surly Pack Rat - 2018",
        "content": "Hit the road with confidence on the 2018 Surly Pack Rat. This road bike, falling under the Road Bikes category, is tailored for the avid cyclist who craves reliability and performance on the pavement. Its 2018 model year is a testament to Surly's dedication to cycling excellence, ensuring that riders have the latest in road bike technology. With a list price of $1,349.00, the Surly Pack Rat offers a perfect blend of quality and value, making it an ideal choice for both commuting and long-distance touring. Embrace the journey with the precision and durability synonymous with the Surly brand."
    },
    {
        "id": "164",
        "title": "Surly Straggler 650b - 2018",
        "content": "Hit the road with the 2018 Surly Straggler 650b, a premium choice for both commuting and long-distance cycling. As part of the Road Bikes category, this Surly bike is engineered for speed, efficiency, and comfort on paved surfaces. The 2018 model year brings with it the latest in cycling technology and design, ensuring a top-notch riding experience. With a list price of $1549.00, the Surly Straggler 650b offers quality and performance that seasoned cyclists and enthusiasts will appreciate. Embark on your next journey with the reliability and craftsmanship of Surly."
    },
    {
        "id": "165",
        "title": "Trek 1120 - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek 1120. This exquisite road bike, falling under the category of Road Bikes, is engineered for speed, agility, and endurance on long rides. The Trek brand is synonymous with quality, and this model is no exception. It boasts a model year of 2018, featuring the latest in cycling technology for a smooth and efficient ride. The list price of $2499.99 is a testament to its premium build and the exceptional experience it offers. Embark on your next road adventure with the confidence and support of the Trek 1120."
    },
    {
        "id": "166",
        "title": "Trek Domane AL 2 Women's - 2018",
        "content": "Hit the open road with the 2018 Trek Domane AL 2 Women's road bike. This sleek and elegant road bike, falling under the Road Bikes category, offers a tailored ride for women who seek both comfort and performance. Crafted by the reputable brand Trek, it features a design optimized for long-distance journeys and high-speed pursuits. Its model year of 2018 signifies a modern approach to cycling technology, and at a list price of $749.99, it delivers exceptional value for cyclists looking to elevate their riding experience. Enjoy the smooth pavement under your wheels with the precision engineering of the Trek Domane AL 2 Women's."
    },
    {
        "id": "167",
        "title": "Surly ECR Frameset - 2018",
        "content": "Hit the road with the 2018 Surly ECR Frameset. This high-quality road bike, falling under the Road Bikes category, offers a fantastic foundation for riders looking to build their custom dream bike. The Surly brand is renowned for its strong and versatile frames, making the ECR Frameset a perfect choice for both long-distance touring and everyday commuting. With a model year of 2018, you can trust that you're getting modern design with reliability in mind. Priced at $749.99, it's a smart investment for serious cyclists who value performance and personalization."
    },
    {
        "id": "168",
        "title": "Surly Straggler by Surly",
        "content": "Hit the pavement with style on the 2018 Surly Straggler. This high-performance road bike, falling under the Road Bikes category, is perfect for both casual rides and long-distance touring. Crafted with Surly's dedication to quality, the Straggler offers a comfortable yet responsive ride. Its 2018 model year promises contemporary features and a sleek design, while the list price of $1549.00 reflects its premium status. Gear up for your next road adventure with the dependable and stylish Surly Straggler."
    },
    {
        "id": "169",
        "title": "Trek Emonda SLR 8 - 2018",
        "content": "Hit the road with speed and style on the 2018 Trek Emonda SLR 8. This high-performance road bike, falling under the category of Road Bikes, is engineered for cyclists who demand the best in speed, weight, and handling. The model year 2018 is a testament to Trek's continuous innovation, and the list price of $6,499.99 reflects the premium quality and advanced technology that goes into each bike. Whether you're tackling long-distance rides or sprinting for the finish line, the Trek Emonda SLR 8 is built to elevate your road cycling experience."
    },
    {
        "id": "170",
        "title": "Trek CrossRip 2 - 2018",
        "content": "Hit the pavement with speed and agility on the 2018 Trek CrossRip 2. This high-performance road bike, falling under the Road Bikes category, is engineered for those who crave speed and efficiency. The CrossRip 2 combines Trek's renowned design with advanced road technology, offering a bike that's as robust as it is swift. The model year 2018 is a testament to modern cycling innovation, and with a list price of $1,299.99, you're investing in premium quality that's worth every penny. Make every ride an exhilarating journey with the Trek CrossRip 2."
    },
    {
        "id": "171",
        "title": "Trek Domane SL 6 - 2018",
        "content": "Hit the road with precision and speed on the 2018 Trek Domane SL 6. This high-performance road bike, falling under the Road Bikes category, is engineered for both endurance and comfort. The Domane SL 6 is a testament to Trek's commitment to quality, offering a smooth ride that's perfect for long-distance cyclists and speed enthusiasts alike. With a model year of 2018, you'll benefit from recent advancements in cycling technology. Priced at $3199.99, this bike is an investment in your passion for road cycling, promising countless miles of exhilarating rides."
    },
    {
        "id": "172",
        "title": "Trek Domane ALR Disc Frameset - 2018",
        "content": "Hit the road with confidence on the 2018 Trek Domane ALR Disc Frameset. A premium offering in the Road Bikes category, this frameset is the perfect foundation for cyclists who demand the best in speed and stability. The 2018 model year is a testament to Trek's continuous innovation, and with a list price of $3,199.99, you're investing in a top-tier frameset known for its exceptional performance and durability. Build your dream road bike with the Trek Domane ALR Disc Frameset and experience the thrill of the ride in style."
    },
    {
        "id": "173",
        "title": "Trek Domane ALR Frameset - 2018",
        "content": "Hit the pavement with precision and style on the 2018 Trek Domane ALR Frameset. This premium road bike, falling under the Road Bikes category, is the ideal choice for cyclists seeking a high-performance ride. Crafted by the renowned brand Trek, the Domane ALR Frameset is engineered for speed, comfort, and efficiency on long rides. With a model year of 2018, you're getting the latest in cycling innovation and design. The list price of $3199.99 is a testament to the quality and advanced features you can expect from a bike of this pedigree. Elevate your road cycling experience with the Trek Domane ALR Frameset."
    },
    {
        "id": "174",
        "title": "Trek Domane SLR Disc Frameset - 2018",
        "content": "Hit the road with unmatched style and performance with the 2018 Trek Domane SLR Disc Frameset. This premium road bike, falling under the Road Bikes category, is engineered for speed, comfort, and efficiency on long rides and challenging terrains. The model year 2018 represents Trek's commitment to innovation, ensuring you benefit from the latest advancements in bike design. With a list price of $3199.99, the Trek Domane SLR Disc Frameset offers a top-tier cycling experience for serious enthusiasts who demand the best in road biking technology."
    },
    {
        "id": "175",
        "title": "Trek Domane SLR Frameset - 2018",
        "content": "Hit the pavement with the sleek and high-performance 2018 Trek Domane SLR Frameset. As a premium offering in the Road Bikes category, this frameset is the perfect foundation for cyclists who demand the best in speed, comfort, and efficiency. The 2018 model year brings with it the latest advancements in Trek's engineering, ensuring a ride that's as smooth as it is fast. With a list price of $3199.99, the Trek Domane SLR Frameset is an investment in top-tier cycling technology and design that stands the test of time."
    },
    {
        "id": "176",
        "title": "Trek Madone 9 Frameset - 2018",
        "content": "Experience the pinnacle of road cycling performance with the 2018 Trek Madone 9 Frameset. Crafted by the renowned brand Trek, this frameset is the foundation for a high-caliber road bike, falling under the prestigious category of Road Bikes. It combines advanced aerodynamics with superior rider comfort, making it a top choice for competitive cyclists and enthusiasts alike. The model year 2018 reflects its cutting-edge design and engineering, while the list price of $3199.99 signifies an investment in premium quality and unparalleled speed. Build your dream bike and dominate the asphalt with the Trek Madone 9 Frameset."
    },
    {
        "id": "177",
        "title": "Trek Domane SLR 6 Disc - 2018",
        "content": "Hit the pavement with precision and speed on the 2018 Trek Domane SLR 6 Disc. This high-performance road bike falls under the Road Bikes category and is engineered for serious cyclists who demand top-tier quality. The Domane SLR 6 Disc is built to deliver a combination of comfort and agility on long rides, featuring a model year 2018 design that incorporates the latest advancements in cycling technology. With a list price of $5499.99, you're investing in a premium cycling experience that benefits from Trek's renowned craftsmanship and innovation in bike design."
    },
    {
        "id": "178",
        "title": "Trek Domane AL 2 - 2018",
        "content": "Hit the road with confidence on the 2018 Trek Domane AL 2. Crafted for performance and comfort, this distinguished road bike falls under the Road Bikes category, offering a smooth and efficient ride. The Domane AL 2 is built to deliver stability and speed, making long rides more enjoyable. With a model year of 2018, you can trust in its modern design and features. Priced at $749.99, it's an investment in your cycling passion without breaking the bank. Embrace the journey with the precision engineering of Trek."
    },
    {
        "id": "179",
        "title": "Trek Domane AL 3 - 2018",
        "content": "Hit the pavement with speed and agility on the 2018 Trek Domane AL 3. Perfectly crafted for road biking enthusiasts, this model falls under the Road Bikes category and is designed for high performance and endurance. The Trek brand is synonymous with quality, and this bike is no exception. With its lightweight frame and precision engineering, the Domane AL 3 provides a smooth and efficient ride. A model year of 2018 ensures you're equipped with recent advancements in bike technology. Priced at $919.99, it's an investment in your cycling passion that promises to deliver exhilarating experiences on the road."
    },
    {
        "id": "180",
        "title": "Trek Domane AL 3 Womens - 2018",
        "content": "Hit the pavement in style with the 2018 Trek Domane AL 3 Womens road bike. Specially designed for the avid female cyclist, this bike falls under the Road Bikes category and is perfect for both leisurely rides and competitive racing. Built by the reputable brand Trek, it offers a comfortable yet high-performance cycling experience. The model year 2018 is a testament to its modern design and reliable technology. Priced at $919.99, the Trek Domane AL 3 Womens offers superb value for cyclists looking to elevate their road biking experience."
    },
    {
        "id": "181",
        "title": "Trek Domane SL 5 - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane SL 5. This high-quality road bike, which falls under the Road Bikes category, is engineered for speed, comfort, and efficiency on long rides. The model year 2018 signifies it's equipped with modern features and the latest cycling technology. Priced at $2199.99, the Trek Domane SL 5 offers a blend of durability and advanced design for the serious cyclist. Embrace the thrill of the road with Trek's renowned craftsmanship and innovative spirit."
    },
    {
        "id": "182",
        "title": "Trek Domane SL 5 Disc - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane SL 5 Disc. This premium road bike, falling under the Road Bikes category, is engineered for speed, comfort, and reliability. The Domane SL 5 Disc features a lightweight frame and advanced disc brake system for precise stopping power and control. The model year 2018 signifies that you're getting the latest advancements in road cycling technology. Priced at $2499.99, this bike represents a significant investment in your cycling passion, backed by Trek's renowned commitment to quality. Elevate your road riding experience with the Domane SL 5 Disc."
    },
    {
        "id": "183",
        "title": "Trek Domane SL 5 Womens - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane SL 5 Womens. Crafted for speed and comfort, this road bike fits perfectly into the Road Bikes category, offering a smooth and responsive ride for both casual cyclists and competitive enthusiasts alike. The model year 2018 brings with it the latest in cycling innovation from Trek, ensuring reliability and efficiency. Priced at $2199.99, the Trek Domane SL 5 Womens provides exceptional value for a premium road bike, making it an ideal choice for those looking to elevate their cycling experience."
    },
    {
        "id": "184",
        "title": "Trek Domane SL 6 Disc - 2018",
        "content": "Hit the pavement with style and performance on the 2018 Trek Domane SL 6 Disc. As a premium offering in the Road Bikes category, this model is engineered for speed, stability, and endurance. Its cutting-edge design and advanced features are perfect for serious cyclists who demand the best. With a model year of 2018, you can trust that you're getting the latest in road bike technology. Priced at $3499.99, the Trek Domane SL 6 Disc represents a significant investment in your cycling passion. Experience the thrill of the ride with Trek's renowned quality and craftsmanship."
    },
    {
        "id": "185",
        "title": "Trek Conduit+ - 2018",
        "content": "Experience the future of cycling with the 2018 Trek Conduit+, a top-tier electric bike designed for the modern rider. As part of the Electric Bikes category, the Trek Conduit+ combines the reliability of Trek's brand with cutting-edge technology to offer a seamless ride. Whether you're commuting to work or enjoying a leisurely ride in the park, this bike provides ample power and a comfortable experience. With a model year of 2018, you can trust that you're getting the latest in e-bike innovation. The list price of $2799.99 is a reflection of the quality and advanced features that come standard with this exceptional electric bicycle. Embrace a greener commute and enhanced cycling pleasure with the Trek Conduit+."
    },
    {
        "id": "186",
        "title": "Trek CrossRip+ - 2018",
        "content": "Hit the road with the power-assisted performance of the 2018 Trek CrossRip+. Designed for the modern cyclist, this electric bike falls under the Electric Bikes category, offering an innovative blend of efficiency and power. With a model year of 2018, you get the latest in e-bike technology, ensuring a smooth and exhilarating ride. Priced at $4499.99, the Trek CrossRip+ is an investment in top-tier engineering and sustainable commuting. Trek's reputation for quality shines through in every pedal stroke and electric boost, making your journey both enjoyable and eco-friendly."
    },
    {
        "id": "187",
        "title": "Trek Neko+ - 2018",
        "content": "Elevate your riding experience with the 2018 Trek Neko+, a premier electric bike designed for both efficiency and adventure. As part of the Electric Bikes category, the Trek Neko+ combines the best of both worlds, offering the assistive power of an electric motor with the agility and performance of a traditional bicycle. Built with the quality and innovation Trek is known for, this model is perfect for commuters and enthusiasts alike. With a model year of 2018, riders can enjoy the latest in e-bike technology. Priced at $2799.99, the Trek Neko+ is an investment in top-tier cycling performance and environmental sustainability."
    },
    {
        "id": "188",
        "title": "Trek XM700+ Lowstep - 2018",
        "content": "Experience the future of cycling with the 2018 Trek XM700+ Lowstep, an innovative addition to the Electric Bikes category. This cutting-edge bike by Trek is designed to boost your riding experience with electric assistance, making every journey easier and more enjoyable. The Lowstep frame design provides the convenience of easier mounting and dismounting, which is perfect for urban commuters and leisure riders alike. With a model year of 2018, you can trust in the modern technology that propels you forward. Priced at $3499.99, the Trek XM700+ Lowstep is an investment in both quality and the joy of cycling."
    },
    {
        "id": "189",
        "title": "Trek Lift+ Lowstep - 2018",
        "content": "Elevate your cycling experience with the 2018 Trek Lift+ Lowstep. This electric bike, which falls under the Electric Bikes category, offers a smooth and efficient ride with the added benefit of electric assistance. The lowstep frame design makes it easy to hop on and off, providing a comfortable ride for all cyclists. With a model year of 2018, you can trust in the modern technology that powers this bike, ensuring a reliable and enjoyable ride. The list price of $2799.99 is a testament to the quality and advanced features you get with this bike. Trek's reputation for excellence is clearly reflected in the Lift+ Lowstep, making it a top choice for riders looking to boost their cycling adventures."
    },
    {
        "id": "190",
        "title": "Trek Dual Sport+ - 2018",
        "content": "Elevate your cycling experience with the 2018 Trek Dual Sport+ Electric Bike. This high-performance electric bike falls under the category of Electric Bikes and is perfect for both urban commuting and off-road adventures. With its advanced power-assist technology, you can go further and faster, making every ride exhilarating. The model year 2018 guarantees modern features and a reliable ride. A list price of $2799.99 is a worthy investment for a versatile bike that promises to energize your daily commutes and weekend explorations. Get ready to boost your rides with the innovation and quality of Trek."
    },
    {
        "id": "191",
        "title": "Electra Loft Go! 8i - 2018",
        "content": "Effortlessly glide through the city with the 2018 Electra Loft Go! 8i. This sophisticated electric bike, falling under the Electric Bikes category, offers a smooth and eco-friendly ride for the urban commuter. With its sleek design and innovative technology, the Electra Loft Go! 8i ensures a comfortable and efficient journey. The model year 2018 combines modern features with reliable performance, and the list price of $2799.99 reflects the premium quality and advanced engineering you can expect from Electra. Embrace a greener commute and cutting-edge design with the Electra Loft Go! 8i."
    },
    {
        "id": "192",
        "title": "Electra Townie Go! 8i - 2017/2018",
        "content": "Experience the joy of effortless riding with the 2018 Electra Townie Go! 8i, a top choice in the Electric Bikes category. This innovative electric bike combines the comfort and style of Electra's Townie series with advanced pedal-assist technology, allowing you to ride further with less fatigue. Whether you're commuting to work or enjoying a leisurely ride around town, the Townie Go! 8i offers a smooth and enjoyable cycling experience. With a model year of 2018, this bike integrates modern features and a reliable performance that Electra is known for. At a list price of $2599.99, it's an investment in both convenience and fun, elevating your biking adventures to new heights."
    },
    {
        "id": "193",
        "title": "Trek Lift+ - 2018",
        "content": "Elevate your cycling experience with the 2018 Trek Lift+, a premium electric bike designed for the ultimate riding pleasure. As part of the Electric Bikes category, the Trek Lift+ blends the reliability of a Trek bike with the latest in e-bike technology. Its 2018 model year guarantees modern features and efficient performance. With a list price of $2799.99, you're investing in a top-tier electric bike that promises to enhance your commutes and leisure rides with ease and style. Trek's reputation for quality shines through with the Lift+, making every journey a joy."
    },
    {
        "id": "194",
        "title": "Trek XM700+ - 2018",
        "content": "Experience the future of cycling with the 2018 Trek XM700+. As part of the Electric Bikes category, this innovative bike combines Trek's renowned craftsmanship with cutting-edge technology. Designed for both the urban commuter and the leisure rider, the XM700+ offers a smooth and efficient ride with its electric assist feature. The model year 2018 reflects its modern features and advanced design, and with a list price of $3499.99, it's an investment in top-tier cycling performance and eco-friendly transportation. Embrace speed and convenience with the Trek XM700+."
    },
    {
        "id": "195",
        "title": "Electra Townie Go! 8i Ladies - 2018",
        "content": "Experience the perfect blend of comfort and modern technology with the 2018 Electra Townie Go! 8i Ladies electric bike. As a notable offering in the Electric Bikes category, this stylish bike is designed for the eco-conscious woman who values both aesthetics and performance. It boasts a smooth ride with easy-to-use power assistance that makes cycling a breeze, no matter the distance or terrain. With a list price of $2599.99, the Electra Townie Go! 8i Ladies is an investment in top-tier cycling innovation, ensuring a delightful and efficient ride every time."
    },
    {
        "id": "196",
        "title": "Trek Verve+ - 2018",
        "content": "Experience the future of cycling with the 2018 Trek Verve+, a top-tier electric bike designed for both efficiency and comfort. As part of the Electric Bikes category, the Trek Verve+ combines the reliability of the Trek brand with innovative electric assist technology to amplify your pedaling power. The model year 2018 reflects the integration of modern features and the bike's state-of-the-art engineering. With a list price of $2299.99, you are investing in a premium cycling companion that will enhance your rides with seamless assistance and enduring performance. Embrace the electric revolution and journey farther with the Trek Verve+."
    },
    {
        "id": "197",
        "title": "Trek Verve+ Lowstep - 2018",
        "content": "Elevate your cycling experience with the 2018 Trek Verve+ Lowstep, a top-of-the-line electric bike from the renowned brand Trek. Categorized under Electric Bikes, this innovative model is perfect for both commuting and leisurely rides, offering an effortless boost to your pedaling power. The Verve+ Lowstep's design prioritizes comfort and ease of use, making it an excellent choice for riders of all levels. With a model year of 2018, it features the latest in e-bike technology and a list price of $2299.99 that reflects its premium quality and advanced features. Journey farther and faster with the reliability and excellence of Trek's Verve+ Lowstep."
    },
    {
        "id": "198",
        "title": "Electra Townie Commute Go! - 2018",
        "content": "Experience the convenience of modern transportation with the 2018 Electra Townie Commute Go! This electric bike, nestled in the Electric Bikes category, offers a seamless blend of efficiency and comfort for your daily commutes. Boasting a model year of 2018, it delivers the latest in electric bike technology, ensuring a reliable and enjoyable ride. With a list price of $2999.99, the Electra Townie Commute Go! is an investment in both your mobility and environmental sustainability. Electra's reputation for quality is evident in every aspect of this bike, making it a smart choice for the eco-conscious commuter."
    },
    {
        "id": "199",
        "title": "Electra Townie Commute Go! Ladies - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute Go! Ladies electric bike. This stylish and modern bike falls under the Electric Bikes category, offering an eco-friendly and efficient way to get around town. The combination of Electra's innovative design and the convenience of electric power means you can enjoy a smooth and effortless ride every time. With a model year of 2018, you're getting the latest in electric bike technology, and the list price of $2999.99 is a worthy investment for a premium commuting experience. Electra ensures that your ride is not just about getting from point A to point B, but doing so with comfort, style, and ease."
    },
    {
        "id": "200",
        "title": "Trek Powerfly 5 - 2018",
        "content": "Boost your riding experience with the 2018 Trek Powerfly 5. This high-performance electric bike, falling under the Electric Bikes category, is engineered for those who seek adventure and efficiency. The Powerfly 5 combines Trek's renowned bike craftsmanship with the latest in e-bike technology, allowing you to ride farther and faster with less effort. With a model year of 2018, you're equipped with up-to-date features and design. Priced at $3499.99, the Trek Powerfly 5 offers a premium blend of power, durability, and cutting-edge innovation, making it a smart investment for any cycling enthusiast."
    },
    {
        "id": "201",
        "title": "Trek Powerfly 5 FS - 2018",
        "content": "Elevate your cycling experience with the 2018 Trek Powerfly 5 FS. This high-performance electric bike, falling under the Electric Bikes category, offers a perfect blend of power and agility for the modern rider. With its advanced electric assist system, you can tackle longer distances and steeper climbs with less effort. The model year 2018 signifies that you'll benefit from recent innovations in e-bike technology. Priced at $4499.99, the Trek Powerfly 5 FS is an investment in both quality and the joy of cycling, making every ride an exhilarating adventure."
    },
    {
        "id": "202",
        "title": "Trek Powerfly 5 Women's - 2018",
        "content": "Experience the future of cycling with the 2018 Trek Powerfly 5 Women's electric bike. This innovative bike, falling under the Electric Bikes category, is designed specifically for women who seek the thrill of adventure with an extra boost of power. The model year 2018 reflects the latest in e-bike technology, offering both reliability and high performance. With a list price of $3499.99, the Trek Powerfly 5 Women's is an investment in top-tier cycling technology that delivers speed, endurance, and comfort on all your rides. Embrace the electric revolution and elevate your biking experience with the quality of Trek."
    },
    {
        "id": "203",
        "title": "Trek Powerfly 7 FS - 2018",
        "content": "Elevate your cycling experience with the 2018 Trek Powerfly 7 FS. This innovative electric bike, falling under the Electric Bikes category, is designed to boost your riding capabilities with electric assistance. It's perfect for extending your adventures and tackling challenging terrains without compromising on comfort. The model year 2018 combines the latest in e-bike technology with Trek's renowned build quality. With a list price of $4999.99, the Trek Powerfly 7 FS offers a premium electric biking experience for those looking to push the boundaries of where a bike can take them."
    },
    {
        "id": "204",
        "title": "Trek Super Commuter+ 7 - 2018",
        "content": "Transform your daily travel with the 2018 Trek Super Commuter+ 7. This state-of-the-art electric bike, falling under the Electric Bikes category, is engineered for the ultimate urban commuting experience. It combines the reliability of a Trek bike with advanced electric assist technology to make your ride faster and more enjoyable. The model year 2018 reflects the latest in e-bike innovation, offering a smooth and efficient ride. With a list price of $3599.99, the Trek Super Commuter+ 7 represents a premium choice for commuters who value speed, comfort, and cutting-edge features."
    },
    {
        "id": "205",
        "title": "Trek Super Commuter+ 8S - 2018",
        "content": "Elevate your daily travel with the 2018 Trek Super Commuter+ 8S. As an innovative addition to the Electric Bikes category, this high-performance e-bike combines Trek's renowned design with cutting-edge electric technology. Perfect for the urban commuter, the Super Commuter+ 8S offers a smooth, efficient ride with the added boost of electric power to ease your journey. The model year 2018 reflects its up-to-date features, while the list price of $4999.99 is an investment in top-tier commuting convenience and sustainability. Join the e-bike revolution with the reliability of Trek."
    },
    {
        "id": "206",
        "title": "Trek Boone 5 Disc - 2018",
        "content": "Dominate the cyclocross scene with the 2018 Trek Boone 5 Disc. This high-performance cyclocross bicycle is engineered by Trek, a brand synonymous with quality and innovation. As part of the Cyclocross Bicycles category, it's specifically designed to excel in off-road racing conditions with its lightweight frame and powerful disc brakes. The model year 2018 is a testament to its modern features and reliability on challenging courses. Priced at $3299.99, the Trek Boone 5 Disc offers a competitive edge for cyclocross enthusiasts who demand excellence on the track."
    },
    {
        "id": "207",
        "title": "Trek Boone 7 Disc - 2018",
        "content": "Dominate any cyclocross course with the 2018 Trek Boone 7 Disc. This high-performance cyclocross bike, falling under the Cyclocross Bicycles category, is engineered for speed, efficiency, and durability. The Boone 7 Disc features advanced technology and a lightweight yet sturdy frame to tackle muddy pits, sand, grass, and obstacles with confidence. The model year 2018 signifies a bike equipped with modern features to elevate your racing experience, and the list price of $3999.99 is a testament to the premium quality and craftsmanship you get with Trek. Get ready to push your limits and stand atop the podium with this exceptional cyclocross machine."
    },
    {
        "id": "208",
        "title": "Trek Crockett 5 Disc - 2018",
        "content": "Dominate the cyclocross circuit with the 2018 Trek Crockett 5 Disc. This high-performance cyclocross bike, from the Cyclocross Bicycles category, is engineered to excel in both racing and daily riding. The Crockett 5 Disc comes equipped with a robust frame, precision disc brakes, and a model year 2018 design that's built for agility and speed. Priced at $1799.99, it offers a premium blend of performance and value. Gear up for your next challenge with the reliability and excellence of Trek."
    },
    {
        "id": "209",
        "title": "Trek Crockett 7 Disc - 2018",
        "content": "Dominate the cyclocross circuit with the 2018 Trek Crockett 7 Disc. This high-performance bike, falling under the Cyclocross Bicycles category, is engineered for speed, efficiency, and durability. Tackle challenging terrains and sharp turns with confidence thanks to its precision disc brakes and robust design. The model year 2018 is a testament to Trek's continuous innovation in the world of competitive cycling. Priced at $2999.99, the Trek Crockett 7 Disc offers a premium experience for serious cyclists who demand the best in their equipment. Get ready to elevate your cyclocross performance with this exceptional offering from Trek."
    },
    {
        "id": "210",
        "title": "Surly Straggler - 2018",
        "content": "Dominate the cyclocross scene with the 2018 Surly Straggler. This top-notch cyclocross bicycle, belonging to the Cyclocross Bicycles category, is engineered for agility, durability, and performance. Its robust construction and design allow you to tackle mixed terrains and challenging courses with confidence. The model year 2018 is a testament to Surly's commitment to quality, and the list price of $1,549.00 ensures you get a competitive edge with a bike that's built to last. Take your cyclocross experience to the next level with the Surly Straggler."
    },
    {
        "id": "211",
        "title": "Surly Straggler 650b - 2018",
        "content": "The 2018 Surly Straggler 650b is a versatile and robust cyclocross bicycle that's perfect for the adventure cyclist. Falling under the category of Cyclocross Bicycles, it's engineered for both off-road and on-road performance, giving you the freedom to push boundaries across various terrains. With a model year of 2018, you can trust that you're getting a bike with up-to-date features for durability and performance. At a list price of $1549.00, the Surly Straggler 650b offers a great balance of price and quality, making it a smart investment for cyclists who demand versatility and reliability on their rides."
    },
    {
        "id": "212",
        "title": "Electra Townie Original 21D - 2018",
        "content": "Cruise through the city streets in style with the 2018 Electra Townie Original 21D. This elegant cruiser bicycle, falling under the category of Cruisers Bicycles, offers a comfortable and relaxed riding experience. Its 2018 model year ensures you're enjoying the latest in cruiser bike advancements, while the list price of $559.99 is a great investment for a high-quality, stylish ride. The Electra brand is known for its attention to detail and commitment to rider satisfaction, making the Townie Original 21D a top choice for casual cyclists and enthusiasts alike."
    },
    {
        "id": "213",
        "title": "Electra Cruiser 1",
        "content": "Cruise the streets in style with the Electra Cruiser 1, available from model years 2016 to 2018. Perfectly designed for leisurely rides and city exploration, this bike falls under the Cruisers Bicycles category and is a testament to Electra's dedication to comfort and simplicity. The 2018 model year promises up-to-date features and a smooth riding experience. With a list price of $269.99, the Electra Cruiser 1 offers an affordable way to enjoy cycling with a touch of elegance. Embrace the laid-back cycling lifestyle with this classic cruiser."
    },
    {
        "id": "214",
        "title": "Electra Tiger Shark 3i by Electra",
        "content": "Cruise in style with the 2018 Electra Tiger Shark 3i. This eye-catching cruiser bicycle falls under the Cruisers Bicycles category, perfect for leisurely rides and soaking in the scenery. Its distinctive design and 3-speed internal gear hub make it a joy to ride on both city streets and beachside promenades. With a model year of 2018, you can be assured of modern features and a reliable ride. The list price of $899.99 offers you the chance to own a premium bike from Electra, a brand known for its commitment to quality and unique flair."
    },
    {
        "id": "215",
        "title": "Electra Queen of Hearts 3i - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Queen of Hearts 3i. This chic cruiser bicycle, nestled comfortably in the Cruisers Bicycles category, offers a blend of comfort and flair for the casual rider. Its distinctive design and smooth 3-speed internal gear system make it a standout choice for leisurely rides and city adventures. The model year 2018 reflects Electra's commitment to quality, while the list price of $749.99 ensures that this fashionable ride can be yours without breaking the bank. Embrace the joy of cycling with the elegance and charm of the Electra Queen of Hearts 3i."
    },
    {
        "id": "216",
        "title": "Electra Super Moto 8i - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Super Moto 8i. This sleek cruiser bicycle, falling under the Cruisers Bicycles category, offers a comfortable and stylish ride for the urban adventurer. Boasting a model year of 2018, it combines modern design with classic cruiser features. The Electra brand is known for its quality craftsmanship, and this bike is no exception. Priced at $899.99, the Super Moto 8i represents a fantastic choice for those seeking a reliable and chic bicycle for their daily jaunts around town."
    },
    {
        "id": "217",
        "title": "Electra Straight 8 3i - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Straight 8 3i. This sleek cruiser bicycle, falling under the category of Cruisers Bicycles, offers a comfortable and stylish ride for those leisurely weekend excursions. With its signature Electra design and the 2018 model year, you're getting a reliable and well-crafted bike that stands out from the crowd. Priced at $909.99, the Electra Straight 8 3i is an excellent investment for anyone looking to add a bit of fun and flair to their cycling experiences."
    },
    {
        "id": "218",
        "title": "Electra Cruiser 7D - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Cruiser 7D. This elegant bicycle, falling under the Cruisers Bicycles category, offers a smooth and comfortable ride perfect for leisurely weekend jaunts or daily commutes. With its classic design and updated features for the model year 2018, you'll enjoy the perfect blend of fashion and function. The Electra Cruiser 7D is built for relaxed rides with a touch of vintage flair, and at a list price of $319.99, it's an affordable option for anyone looking to add a little joy to their cycling experience. Revel in the simplicity and joy of riding with Electra's timeless Cruiser 7D."
    },
    {
        "id": "219",
        "title": "Electra Moto 3i - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Moto 3i. This eye-catching cruiser bicycle, falling under the Cruisers Bicycles category, offers a blend of comfort and cool. Crafted for leisurely rides around town or by the beach, it boasts a unique design and an easy-going ride quality. The model year 2018 ensures you're enjoying the latest in cruiser bike innovation, while the list price of $639.99 is a great investment for a premium cycling experience. Embrace the laid-back lifestyle with Electra's renowned quality and charm."
    },
    {
        "id": "220",
        "title": "Electra Cruiser 1 Ladies - 2018",
        "content": "Cruise in style with the 2018 Electra Cruiser 1 Ladies bicycle. This elegant bike, falling under the Cruisers Bicycles category, offers a perfect blend of comfort and simplicity for leisurely rides. Designed specifically for women, the Cruiser 1 Ladies model boasts a classic design with smooth curves and an easy-going ride feel. The model year 2018 reflects Electra's dedication to providing up-to-date features for a more enjoyable experience. Priced at $269.99, it's an affordable option for those looking to add a touch of luxury to their daily commutes or weekend adventures. Embrace the laid-back lifestyle with Electra's timeless charm and quality craftsmanship."
    },
    {
        "id": "221",
        "title": "Electra Cruiser 7D Ladies - 2016/2018",
        "content": "Cruise the city streets in style with the 2018 Electra Cruiser 7D Ladies bike. This chic bicycle falls under the Cruisers Bicycles category, offering a smooth and comfortable ride for leisurely adventures. Its classic design and modern features blend to create a delightful experience for riders. With a model year of 2018, you can trust in the recent technology and advancements made for cruiser bikes. The list price of $319.99 ensures this Electra bike is a great investment for those looking for quality and style without breaking the bank. Enjoy your ride with the elegance and reliability of the Electra brand."
    },
    {
        "id": "222",
        "title": "Electra Cruiser 1 Tall - 2016/2018",
        "content": "Cruise the streets in style with the 2018 Electra Cruiser 1 Tall. This elegant bike, falling under the Cruisers Bicycles category, offers a perfect blend of comfort and simplicity for those leisurely rides. Boasting a model year that spans from 2016 to 2018, you can trust in the quality and timeless design that Electra is known for. With a list price of $269.99, the Cruiser 1 Tall is an affordable option for anyone looking to enjoy the relaxed pace of cruiser biking. Experience the smooth ride and classic charm of an Electra cruiser."
    },
    {
        "id": "223",
        "title": "Electra Cruiser Lux 3i - 2018",
        "content": "Cruise in style with the 2018 Electra Cruiser Lux 3i. This elegant bike, falling under the Cruisers Bicycles category, offers a perfect blend of comfort and vintage design for leisurely rides along the beach or through the city. With its 2018 model year, you'll enjoy modern features combined with classic aesthetics. The Electra Cruiser Lux 3i is available at an attractive price of $529.99, ensuring you get a premium cruising experience without breaking the bank. Embrace the relaxed biking lifestyle with Electra's renowned quality and charm."
    },
    {
        "id": "224",
        "title": "Electra Cruiser Lux 7D - 2018",
        "content": "Cruise in style with the 2018 Electra Cruiser Lux 7D. This elegant bike, falling under the Cruisers Bicycles category, is perfect for comfortable rides around town or along the boardwalk. Boasting a 2018 model year, this bike combines classic design with modern features. The Electra brand is known for its quality craftsmanship and the Cruiser Lux 7D is no exception. With a list price of $479.99, it offers a fantastic blend of affordability and chic design for the casual rider seeking a relaxing biking experience."
    },
    {
        "id": "225",
        "title": "Electra Delivery 3i - 2018",
        "content": "Cruise around town in style with the 2018 Electra Delivery 3i. This classic cruiser bicycle, falling under the Cruisers Bicycles category, offers a blend of comfort and vintage flair that is perfect for leisurely rides and city commutes. Boasting a model year of 2018, you can trust in the modern features and reliable performance that Electra is known for. Available for a list price of $959.99, the Delivery 3i is an excellent choice for those who value design and ease of use in their biking experience."
    },
    {
        "id": "226",
        "title": "Electra Townie Original 21D EQ",
        "content": "Make your urban commuting and weekend cruising more enjoyable with the 2018 Electra Townie Original 21D EQ. As part of the Cruisers Bicycles category, this stylish bike combines comfort and efficiency for the everyday rider. It comes from Electra, a brand synonymous with quality and innovative design. The model year 2018 reflects the latest in cycling technology that Electra offers, ensuring a smooth and enjoyable ride. Priced at $679.99, the Electra Townie Original 21D EQ offers great value for anyone looking to add a touch of leisure and elegance to their cycling experience."
    },
    {
        "id": "227",
        "title": "Electra Cruiser 7D (24-Inch) Ladies - 2016/2018",
        "content": "Cruise around town in style with the Electra Cruiser 7D (24-Inch) Ladies bike, a seamless blend of comfort and elegance. Belonging to the Cruisers Bicycles category, this bike is ideal for leisurely rides and casual commutes. With a model year of 2018, you'll enjoy the latest in cruiser bike design, ensuring a smooth and enjoyable experience. The Electra brand is known for its attention to detail and quality craftsmanship, and with a list price of just $319.99, this bike offers excellent value for those looking to enjoy the simpler pleasures of cycling."
    },
    {
        "id": "228",
        "title": "Electra Cruiser 7D Tall",
        "content": "Cruise in style and comfort with the 2018 Electra Cruiser 7D Tall. This chic cruiser bicycle falls under the Cruisers Bicycles category and is perfect for leisurely rides around town or by the beach. Sporting a model year of 2018, the Electra Cruiser 7D Tall combines classic design with modern features. With a list price of $319.99, it offers an affordable way to add some fun and relaxation to your daily routine. Electra's reputation for quality ensures that this bike will provide a smooth and enjoyable riding experience."
    },
    {
        "id": "229",
        "title": "Electra Cruiser Lux 1 - 2016/2018",
        "content": "Cruise the city streets in style with the 2018 Electra Cruiser Lux 1. This elegant bike, which falls under the Cruisers Bicycles category, offers a perfect blend of comfort and simplicity for urban riding. Boasting a classic design with modern touches, the Cruiser Lux 1 is equipped to deliver a smooth and enjoyable ride. Its 2018 model year reflects the latest in leisure cycling, and with a list price of $429.99, it's an affordable luxury for anyone looking to add a touch of nostalgia to their daily commute. Embrace the laid-back vibe of cruising with the quality and charm that Electra is known for."
    },
    {
        "id": "230",
        "title": "Electra Cruiser Lux 1 Ladies - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Cruiser Lux 1 Ladies. Tailored for those leisurely rides, this bike falls under the Cruisers Bicycles category and is perfect for a relaxed outing. Crafted with care by Electra, the bike offers a comfortable and chic riding experience. Its 2018 model year reflects a blend of contemporary design with classic cruiser features, all for a list price of $429.99. Embrace the joy of casual biking with the elegant and dependable Electra Cruiser Lux 1 Ladies."
    },
    {
        "id": "231",
        "title": "Electra Cruiser Lux 3i Ladies - 2018",
        "content": "Cruise in style with the 2018 Electra Cruiser Lux 3i Ladies. Perfectly designed for those leisurely rides around town, this elegant cruiser bicycle falls within the Cruisers Bicycles category. The 2018 model year combines contemporary features with a classic aesthetic, offering a smooth and enjoyable riding experience. Priced at $529.99, this bike presents a great opportunity for riders looking to enjoy the comfort and simplicity of a cruiser. With Electra's reputation for quality and design, the Cruiser Lux 3i is sure to turn heads and provide a reliable, charming ride."
    },
    {
        "id": "232",
        "title": "Electra Cruiser Lux 7D Ladies - 2018",
        "content": "Cruise in style with the 2018 Electra Cruiser Lux 7D Ladies. This elegant bike, part of the Cruisers Bicycles category, is perfect for leisurely rides along the beach or through the city streets. Its classic design combined with modern comfort makes it an ideal choice for those who appreciate a blend of style and ease. The model year 2018 signifies a bike with up-to-date features for a smooth and enjoyable ride. With a list price of $479.99, the Electra Cruiser Lux 7D offers a great balance of luxury and affordability for the discerning cyclist who values both aesthetics and function."
    },
    {
        "id": "233",
        "title": "Electra Cruiser Lux Fat Tire 7D - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Cruiser Lux Fat Tire 7D. As part of the Cruisers Bicycles category, this bike offers a blend of comfort and robustness, making it perfect for leisurely rides along the beach or through the city. The thick tires provide excellent stability and grip, allowing you to navigate various surfaces with confidence. With a model year of 2018, you can trust that you're experiencing the latest in cruiser bike innovation, paired with a reasonable list price of $639.99. Embrace the relaxed biking lifestyle with the quality and charm of an Electra cruiser."
    },
    {
        "id": "234",
        "title": "Electra Daydreamer 3i Ladies - 2018",
        "content": "Cruise in style with the 2018 Electra Daydreamer 3i Ladies bike. This charming cruiser, nestled in the Cruisers Bicycles category, offers a perfect blend of comfort and elegance for the casual rider. With its 2018 model year, you can trust in the modern features designed for a smooth and enjoyable ride. The Electra brand is known for its quality craftsmanship, and with a list price of $899.99, the Daydreamer 3i is an attractive choice for those who value both aesthetics and functionality. Embrace leisurely rides and a relaxed biking experience with the Electra Daydreamer 3i."
    },
    {
        "id": "235",
        "title": "Electra Koa 3i Ladies - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Koa 3i Ladies bike. This chic cruiser, part of the Cruisers Bicycles category, offers a perfect blend of comfort and elegance for the leisure rider. Embrace the smooth ride and sophisticated design from Electra, a brand renowned for its quality craftsmanship. The 2018 model year ensures you're enjoying the latest in cruiser bike technology, and with a list price of $899.99, it's an investment in both luxury and leisure. Enjoy a laid-back biking experience with the Electra Koa 3i Ladies cruiser."
    },
    {
        "id": "236",
        "title": "Electra Morningstar 3i Ladies - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Morningstar 3i Ladies bike. This elegant cruiser, nestled in the Cruisers Bicycles category, offers a blend of comfort and chic design tailored for leisurely rides. Crafted by Electra, a brand synonymous with quality and flair, the Morningstar 3i is equipped to provide a smooth and enjoyable cycling experience. The model year 2018 reflects modern features and styling, while the list price of $749.99 ensures you're investing in a high-quality bike without breaking the bank. Embrace the joy of relaxed biking with the Electra Morningstar 3i Ladies cruiser."
    },
    {
        "id": "237",
        "title": "Electra Relic 3i - 2018",
        "content": "Cruise through the city in style with the 2018 Electra Relic 3i. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, offers a perfect blend of comfort and vintage charm. The Electra Relic 3i is built for leisurely rides and laid-back fun. With its 2018 model year, you can trust in the modern features designed for a smooth and enjoyable experience. Priced at $849.99, it's an attractive option for anyone looking to add a touch of nostalgia to their cycling adventures while benefiting from contemporary design and technology. Embrace the relaxed pace of life with the Electra Relic 3i."
    },
    {
        "id": "238",
        "title": "Electra Townie Balloon 8D EQ",
        "content": "Cruise the streets in style with the 2018 Electra Townie Balloon 8D EQ. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, offers a smooth and comfortable ride for leisurely journeys and urban explorations. Its unique design combines classic looks with modern functionality, ensuring you enjoy both form and comfort. With a model year of 2018, you'll benefit from the latest enhancements in cruiser bike technology. Priced at $749.99, this Electra bike is an excellent choice for those who value quality, comfort, and style in their two-wheeled adventures."
    },
    {
        "id": "239",
        "title": "Electra Townie Balloon 8D EQ Ladies - 2018",
        "content": "Cruise the streets in style with the 2018 Electra Townie Balloon 8D EQ Ladies bike. Perfectly placed in the Cruisers Bicycles category, this bike offers a blend of comfort and elegance, designed specifically for those leisurely rides around town. The 2018 model comes with the latest features that Electra is known for, ensuring a smooth and enjoyable cycling experience. With a list price of $749.99, this bike represents a great investment for those who value quality and comfort in their everyday rides. Embrace a relaxed biking lifestyle with the Electra Townie Balloon 8D EQ Ladies."
    },
    {
        "id": "240",
        "title": "Electra Townie Commute 27D Ladies - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute 27D Ladies bike. This stylish cruiser, nestled in the Cruisers Bicycles category, offers a comfortable and chic ride for the urban cyclist. Boasting a model year of 2018, it combines contemporary design with reliable functionality. Equipped with a smooth gear system and ergonomic seating, it's priced at $899.99, providing a premium cycling experience without breaking the bank. Ride in comfort and style with Electra's renowned craftsmanship and attention to detail."
    },
    {
        "id": "241",
        "title": "Electra Townie Commute 8D - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute 8D. This stylish cruiser bicycle, falling under the category of Cruisers Bicycles, offers a comfortable and enjoyable ride for urban adventurers. Built to deliver a unique combination of convenience and efficiency, it's perfect for the city dweller on the go. The model year 2018 reflects a blend of contemporary design with reliable performance, and the list price of $749.99 ensures that you get exceptional value for a premium commuting bike. Embark on your urban journey in comfort and style with Electra's dedication to quality and functionality."
    },
    {
        "id": "242",
        "title": "Electra Townie Commute 8D Ladies - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute 8D Ladies bike. This stylish cruiser, falling under the Cruisers Bicycles category, offers a comfortable and chic ride for the urban cyclist. With Electra's reputation for quality and design, this bike comes with a model year of 2018, ensuring you have the latest in bicycle technology. Priced at $699.99, the Townie Commute 8D is an investment in both practicality and pleasure. Enjoy the smooth ride and convenience that comes with owning an Electra cruiser."
    },
    {
        "id": "243",
        "title": "Electra Townie Original 21D EQ Ladies - 2018",
        "content": "Experience the joy of leisurely rides with the 2018 Electra Townie Original 21D EQ Ladies bike. This elegant cruiser, belonging to the Cruisers Bicycles category, is perfect for those who seek comfort and style on their urban adventures. The bike's design is tailored for the female cyclist, offering an enjoyable and effortless cycling experience. With a model year of 2018, this Electra bike incorporates modern features while maintaining a classic aesthetic. Priced at $679.99, it's an excellent choice for those who appreciate the fusion of quality, comfort, and affordability in their ride. Take on the town with the Electra Townie Original 21D EQ Ladies."
    },
    {
        "id": "244",
        "title": "Electra Townie Original 21D Ladies - 2018",
        "content": "Experience a blend of comfort and style with the 2018 Electra Townie Original 21D Ladies bike. Perfectly crafted for leisurely rides around town, this bike falls under the Cruisers Bicycles category and is designed with a women-specific touch. Its model year 2018 reflects a modern design with reliable features that Electra is known for. The list price of $559.99 ensures you get a premium bike that offers value and elegance for your daily commutes or casual weekend excursions. Enjoy the journey with the sophistication and quality that Electra brings to the cruiser bike experience."
    },
    {
        "id": "245",
        "title": "Electra Townie Original 3i EQ - 2017/2018",
        "content": "Cruise through the city streets in style with the 2018 Electra Townie Original 3i EQ. This chic cruiser bicycle, nestled in the Cruisers Bicycles category, offers a relaxed ride with its unique design and comfortable ergonomics. The Townie Original 3i EQ model is equipped with quality components and an intuitive 3-speed internal gear system, making it perfect for your urban adventures or leisurely beachfront strolls. With a list price of $659.99, Electra delivers a blend of affordability and quality, ensuring a smooth and enjoyable experience on every journey."
    },
    {
        "id": "246",
        "title": "Electra Townie Original 3i EQ Ladies - 2018",
        "content": "Experience the joy of leisure riding with the 2018 Electra Townie Original 3i EQ Ladies. As part of the Cruisers Bicycles category, this charming bike is perfect for casual rides around town or for cruising along the beachfront. The Electra brand is known for creating stylish and comfortable bicycles, and this model is no exception. With its user-friendly design and an attractive list price of $639.99, this bicycle combines quality with affordability. The 2018 model year brings modern features to a classic design, ensuring a delightful ride for women who appreciate both form and function."
    },
    {
        "id": "247",
        "title": "Electra Townie Original 7D EQ - 2018",
        "content": "Cruise the city streets in style with the 2018 Electra Townie Original 7D EQ. This chic cruiser bicycle, falling under the Cruisers Bicycles category, offers a comfortable and stylish ride for both leisurely weekends and daily commutes. With a model year of 2018, it's equipped with modern features that enhance your riding experience. The Electra Townie Original 7D EQ is available at a list price of $599.99, providing a perfect blend of affordability and quality. Embrace the joy of cycling with the elegance and comfort of Electra."
    },
    {
        "id": "248",
        "title": "Electra Townie Original 7D EQ Ladies - 2017/2018",
        "content": "Cruise through your neighborhood with elegance on the 2018 Electra Townie Original 7D EQ Ladies bike. This stylish cruiser, falling under the Cruisers Bicycles category, is perfect for leisurely rides with its comfortable design and easy handling. The 2017/2018 model year combines contemporary features with a classic touch, ensuring a delightful cycling experience. Priced at $599.99, this Electra bike offers a blend of affordability and quality for those who enjoy relaxed biking adventures. Embrace the joy of cruising with the Electra Townie Original 7D EQ Ladies bike."
    },
    {
        "id": "249",
        "title": "Electra White Water 3i - 2018",
        "content": "Cruise in style with the 2018 Electra White Water 3i. This elegant cruiser bicycle, nestled in the Cruisers Bicycles category, offers a smooth and comfortable ride for those leisurely weekend adventures. Crafted by Electra, a brand synonymous with quality and flair, the White Water 3i model combines classic design with modern functionality. The model year 2018 signifies a bike with contemporary features and reliability, while the list price of $749.99 ensures that style and performance come at a great value. Embrace the relaxed pace of life and make every journey a joy with the Electra White Water 3i."
    },
    {
        "id": "250",
        "title": "Electra Townie Go! 8i - 2017/2018",
        "content": "Cruise through the city in style with the Electra Townie Go! 8i. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, combines comfort and performance for the ultimate riding experience. Built for the 2017/2018 model year, it features a user-friendly design perfect for casual rides and commutes. The Electra brand ensures top-notch quality, and with a list price of $2599.99, you're investing in a premium bike that offers the best of both worlds. Take your urban adventures to the next level with the Electra Townie Go! 8i."
    },
    {
        "id": "251",
        "title": "Electra Townie Commute Go! by Electra",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute Go!. Perfectly placed within the Cruisers Bicycles category, this electric bike combines comfort with convenience for an unmatched city riding experience. The model year 2018 reflects a bike equipped with modern features and reliable performance. Sporting a list price of $2,999.99, the Townie Commute Go! offers a premium ride that justifies its value. Get ready to transform your urban travel with Electra's innovation and style."
    },
    {
        "id": "252",
        "title": "Electra Townie Commute Go! Ladies - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute Go! Ladies bicycle. A stylish addition to the Cruisers Bicycles category, this bike combines comfort and functionality for the urban rider. The 2018 model year ensures modern features and a fresh design, while the list price of $2999.99 reflects the premium quality and advanced technology that Electra is known for. Enjoy a smooth and effortless ride around town with this elegant and efficient cruiser."
    },
    {
        "id": "253",
        "title": "Electra Townie Go! 8i Ladies - 2018",
        "content": "Cruise through the city with style on the 2018 Electra Townie Go! 8i Ladies. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, offers a comfortable and stylish ride for the urban cyclist. With Electra's signature design, the Townie Go! 8i Ladies combines fashion with functionality, making it perfect for leisurely rides or daily commutes. The model year 2018 reflects modern features and design, while the list price of $2599.99 is a testament to the quality and sophistication you can expect from an Electra cruiser. Embrace the joy of cycling with a touch of luxury."
    },
    {
        "id": "254",
        "title": "Electra Townie Balloon 3i EQ",
        "content": "Cruise around town in style with the 2018 Electra Townie Balloon 3i EQ. This elegant cruiser bicycle, falling under the Cruisers Bicycles category, offers a blend of comfort and effortless elegance for the casual rider. The 2018 model year brings with it the latest in cycling comfort and design, ensuring a smooth and enjoyable ride every time. Priced at $749.99, the Electra Townie Balloon 3i EQ provides a premium cycling experience without breaking the bank. Make every journey a joyride with Electra's commitment to quality and style."
    },
    {
        "id": "255",
        "title": "Electra Townie Balloon 7i EQ Ladies - 2017/2018",
        "content": "Cruise the city streets in style with the 2018 Electra Townie Balloon 7i EQ Ladies bike. Perfectly placed in the Cruisers Bicycles category, this bike offers a blend of comfort and elegance for the urban cyclist. The 2018 model year incorporates modern features with a classic design, ensuring a smooth and enjoyable ride. Priced at $899.99, this Electra bike promises quality and a delightful cycling experience for those leisurely days around town."
    },
    {
        "id": "256",
        "title": "Electra Townie Commute 27D - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute 27D. This stylish cruiser bicycle falls under the category of Cruisers Bicycles and is the perfect blend of comfort and efficiency for urban travel. Built to deliver a smooth ride, the Townie Commute 27D boasts a relaxed seating position and user-friendly features, making it an excellent choice for city dwellers and leisure riders alike. With a model year of 2018, it incorporates contemporary design with functionality, and the list price of $899.99 reflects its quality and sophistication. Experience the city like never before with the elegance and reliability of an Electra cruiser."
    },
    {
        "id": "257",
        "title": "Electra Amsterdam Fashion 3i Ladies - 2017/2018",
        "content": "Cruise the city streets in style with the Electra Amsterdam Fashion 3i Ladies bike, a perfect blend of elegance and comfort for the urban cyclist. This chic cruiser, part of the Cruisers Bicycles category, offers a unique combination of design and practicality. Its 2018 model year ensures that you're enjoying the latest in cycling technology with a touch of timeless flair. With a list price of $899.99, the Electra Amsterdam Fashion 3i Ladies bike is an investment in both quality and fashion, making every ride an enjoyable experience. Ride with confidence and grace on this exceptional offering from Electra."
    },
    {
        "id": "258",
        "title": "Electra Amsterdam Royal 8i - 2017/2018",
        "content": "Make a stylish statement as you cruise through the streets with the Electra Amsterdam Royal 8i. A true gem in the Cruisers Bicycles category, this elegant bike is perfect for those leisurely rides around town. Crafted with care for the 2017/2018 model year, the Royal 8i combines classic design with modern functionality. Electra's commitment to quality shines through in every detail, ensuring a comfortable and reliable ride. Available for $1259.90, this cruiser bike offers a premium experience for cyclists who appreciate style and comfort."
    },
    {
        "id": "259",
        "title": "Electra Amsterdam Royal 8i Ladies - 2018",
        "content": "Cruise the city streets in style with the 2018 Electra Amsterdam Royal 8i Ladies. This elegant cruiser bicycle, part of the Cruisers Bicycles category, is perfect for leisurely rides and comfortable commutes. Crafted with attention to detail, the bike offers a smooth and enjoyable riding experience. The 2018 model combines modern amenities with a classic design, ensuring you enjoy the best of both worlds. Priced at $1199.99, the Electra Amsterdam Royal 8i Ladies is an investment in both quality and cycling pleasure."
    },
    {
        "id": "260",
        "title": "Electra Townie Balloon 3i EQ Ladies - 2018",
        "content": "Experience the perfect blend of comfort and style with the 2018 Electra Townie Balloon 3i EQ Ladies. As part of the Cruisers Bicycles category, this elegant bike offers a smooth and relaxed ride, ideal for leisurely jaunts through the city or along scenic paths. Its unique design and the model year 2018 reflect Electra's dedication to creating bikes with a timeless appeal and modern functionality. Priced at $799.99, this cruiser bike promises quality and enjoyment on every ride, making it a wonderful investment for those who appreciate the finer aspects of cycling."
    },
    {
        "id": "261",
        "title": "Electra Townie Balloon 7i EQ by Electra",
        "content": "Cruise the streets in style with the 2018 Electra Townie Balloon 7i EQ. This luxurious cruiser bicycle falls under the Cruisers Bicycles category and is perfect for leisurely rides and comfortable commutes. With its unique design and exceptional comfort, the Electra Townie Balloon 7i EQ invites you to enjoy the ride like never before. The model year 2018 signifies a bike equipped with modern features, while the list price of $899.99 is indicative of a premium cycling experience. Get ready to pedal in elegance with Electra's blend of quality and distinctive flair."
    },
    {
        "id": "262",
        "title": "Trek MT 201 - 2018",
        "content": "Introduce your child to the joys of cycling with the 2018 Trek MT 201, a top choice in the Children Bicycles category. This bike is designed to provide a safe and enjoyable ride for the younger crowd, ensuring durability and reliability from the well-respected brand, Trek. With a model year of 2018, the Trek MT 201 incorporates modern features tailored for kids' comfort and ease of use. It's an investment in your child's outdoor activities and fitness, available at a list price of $249.99. Give your child the gift of adventure with the Trek MT 201."
    },
    {
        "id": "263",
        "title": "Strider Classic 12 Balance Bike by Strider",
        "content": "Jumpstart your child's cycling journey with the 2018 Strider Classic 12 Balance Bike. Perfectly placed in the Children Bicycles category, this bike encourages kids to develop their balance and coordination. Manufactured by Strider, a brand synonymous with quality and innovation, the bike is designed for little adventurers aged 18 months to 3 years. The model year 2018 ensures your little ones are enjoying the latest in balance bike technology at an affordable list price of $89.99. Gift your child the joy of riding with the Strider Classic 12 Balance Bike."
    },
    {
        "id": "264",
        "title": "Strider Sport 16 by Strider",
        "content": "Introduce your child to the joy of cycling with the 2018 Strider Sport 16. This expertly crafted children's bicycle, falling under the category of Children Bicycles, is specially designed to provide comfort and safety for young riders. The Strider Sport 16 is perfect for developing balance and coordination, making it an excellent choice for a first bike. With a list price of $249.99, the Strider Sport 16 offers great value and quality, backed by the reputable brand Strider. Help your little one embark on their cycling adventures with this fantastic 2018 model."
    },
    {
        "id": "265",
        "title": "Strider 20 Sport by Strider",
        "content": "Introduce your child to the joy of cycling with the 2018 Strider 20 Sport. This children's bicycle, nestled in the Children Bicycles category, is perfect for young riders taking their first pedal strokes. The Strider 20 Sport is designed with a child-friendly geometry that makes learning to ride easy and fun. Built by Strider, a brand synonymous with quality and innovation, this bike features a model year of 2018, ensuring it comes with the latest in bicycle design for kids. Affordably priced at $289.99, the Strider 20 Sport offers a fantastic way to get your little one moving on two wheels."
    },
    {
        "id": "266",
        "title": "Trek Superfly 20 - 2018",
        "content": "Introduce your child to the joy of cycling with the 2018 Trek Superfly 20. Tailored for young riders, this bike falls under the Children Bicycles category and offers a perfect blend of safety, performance, and fun. Trek's renowned quality shines through in this model, ensuring reliability for the young adventurer. The 2018 model year highlights its modern design and features, while the list price of $399.99 ensures you're investing in a top-quality ride without breaking the bank. Give your child the gift of freedom and excitement with the Trek Superfly 20."
    },
    {
        "id": "267",
        "title": "Trek Precaliber 12 Girls - 2018",
        "content": "Introduce your little one to the joy of cycling with the 2018 Trek Precaliber 12 Girls bicycle. Designed specifically for kids and placed under the Children Bicycles category, this bike offers a comfortable and safe riding experience. The 2018 model year combines contemporary design with child-friendly features, ensuring a reliable and enjoyable introduction to two-wheeled adventures. Priced at $199.99, the Trek Precaliber 12 is an affordable option for parents looking to invest in a quality first bike that will create lasting memories for their girls."
    },
    {
        "id": "268",
        "title": "Trek Kickster - 2018",
        "content": "Introduce your child to the joy of cycling with the 2018 Trek Kickster. This lightweight and safe children's bicycle falls under the Children Bicycles category and is designed to help young ones develop balance and coordination. The Trek Kickster model year 2018 combines the quality and design excellence that Trek is known for. With a list price of $159.99, it offers an affordable way to get your kids started on their biking journey. Let the little adventurers ride with confidence on a Trek Kickster."
    },
    {
        "id": "269",
        "title": "Trek Precaliber 12 Boys - 2018",
        "content": "Introduce your little one to the joy of cycling with the 2018 Trek Precaliber 12 Boys bicycle. As part of the Children Bicycles category, this bike is specifically designed with young riders in mind, offering a safe and enjoyable introduction to biking. Trek's reputation for quality is evident in the durable construction and thoughtful design, ensuring a smooth ride for the aspiring cyclist. Priced at $199.99, the Trek Precaliber 12 Boys bike offers a fantastic blend of performance and value, perfect for families looking to ignite a passion for cycling in their children."
    },
    {
        "id": "270",
        "title": "Trek Precaliber 16 Boys - 2018",
        "content": "Introduce your young one to the joy of cycling with the 2018 Trek Precaliber 16 Boys bike. Specially designed for kids and categorized under Children Bicycles, this bike combines safety, fun, and Trek's renowned quality. It's the perfect starter bike to instill a love of riding and adventure in children. With a model year of 2018, it features up-to-date design and components, tailored for youthful riders. Priced at just $209.99, it offers excellent value for a bike that can accompany your child on countless rides and memories."
    },
    {
        "id": "271",
        "title": "Trek Precaliber 16 Girls - 2018",
        "content": "Introduce your little one to the joy of cycling with the 2018 Trek Precaliber 16 Girls bike. Perfectly crafted for young riders, this bike falls under the Children Bicycles category and is designed with the safety and comfort of children in mind. Trek's reputation for quality is evident in this model, which features child-friendly components and a sturdy build to withstand the learning curve of new riders. With a list price of $209.99, this bike offers a great start for the budding cyclist in your family, combining Trek's dedication to performance with the fun and freedom of childhood adventures."
    },
    {
        "id": "272",
        "title": "Trek Precaliber 20 6-speed Boys - 2018",
        "content": "Introduce your young adventurer to the joy of cycling with the 2018 Trek Precaliber 20 6-speed Boys bike. Perfectly placed in the Children Bicycles category, this bike is designed to provide a comfortable and safe riding experience for kids. Trek's reputation for quality shines through in this model, which combines a kid-friendly design with durability to withstand the learning curve. With a model year of 2018, it features up-to-date technology at a list price of $289.99, making it a smart investment for the budding cyclist in your family."
    },
    {
        "id": "273",
        "title": "Trek Precaliber 20 6-speed Girls - 2018",
        "content": "Introduce your little adventurer to the joy of cycling with the 2018 Trek Precaliber 20 6-speed Girls. This charming bike, falling under the category of Children Bicycles, is specifically designed for young riders. With six speeds to handle varying terrain and a design tailored for girls, it's the perfect start for a lifetime of biking. The 2018 model year combines contemporary features with reliable mechanics, all for the affordable list price of $289.99. Trek's reputation for quality ensures a safe and enjoyable ride for your child."
    },
    {
        "id": "274",
        "title": "Trek Precaliber 20 Boys - 2018",
        "content": "Introduce your young adventurer to the joys of cycling with the 2018 Trek Precaliber 20 Boys bicycle. Perfectly placed within the Children Bicycles category, this bike is designed to provide comfort, stability, and fun for the little ones. Trek's reputation for quality shines through with this 2018 model, ensuring a reliable ride for aspiring cyclists. The list price of $229.99 is a smart investment for a durable bike that will support your child's development and love for biking. Gear up for those memorable rides with the Trek Precaliber 20 Boys bike."
    },
    {
        "id": "275",
        "title": "Trek Precaliber 20 Girls - 2018",
        "content": "Introduce your child to the joy of cycling with the 2018 Trek Precaliber 20 Girls bike. Perfectly designed for young riders, this bike falls under the category of Children Bicycles and is built to inspire a love for riding at an early age. Trek's reputation for quality is evident in the bike's thoughtful features, ensuring safety, comfort, and durability. With a model year of 2018, the Precaliber 20 is equipped with the latest in children's bike technology at a list price of $229.99. It's an investment in your child's health, happiness, and the development of valuable riding skills."
    },
    {
        "id": "276",
        "title": "Trek Precaliber 24 (7-Speed) - Boys by Trek",
        "content": "Inspire your young adventurer with the 2018 Trek Precaliber 24 (7-Speed) - Boys. Crafted with care by Trek, this bike falls under the Children Bicycles category, offering a perfect blend of safety, durability, and fun for the budding cyclist. The model year 2018 brings with it the reliability of modern bike design, tailored for kids' enjoyment. With a list price of $319.99, it's an investment into countless hours of joy and healthy outdoor activity for your child. Choose Trek for a ride that grows with them and memories that last a lifetime."
    },
    {
        "id": "277",
        "title": "Trek Precaliber 24 21-speed Boys - 2018",
        "content": "Introduce your young adventurer to the joy of cycling with the 2018 Trek Precaliber 24 21-speed Boys. Crafted by the renowned brand Trek, this bike is part of the Children Bicycles category and is perfect for boys eager to explore their surroundings. The 21-speed gear system ensures a smooth ride over varying terrains, while the model year 2018 promises the latest in bicycle technology for kids. Priced at $369.99, the Trek Precaliber 24 is an investment in your child's outdoor fun and fitness, offering reliability and enjoyment in every ride."
    },
    {
        "id": "278",
        "title": "Trek Precaliber 24 21-speed Girls - 2018",
        "content": "Introduce your young adventurer to the joys of cycling with the 2018 Trek Precaliber 24 21-speed Girls bike. Perfectly designed for the younger riders, this bike falls under the Children Bicycles category, offering a comfortable and safe riding experience. Trek's commitment to quality shines through in this model, featuring 21 speeds to handle varying terrains with ease. The 2018 model year reflects a bicycle that is up-to-date with current cycling standards for kids. With a list price of $369.99, this bike is a great investment in your child's outdoor activities and physical development. Let them ride with confidence and style on a Trek Precaliber."
    },
    {
        "id": "279",
        "title": "Trek Precaliber 24 7-speed Girls - 2018",
        "content": "Introduce your young adventurer to the joys of cycling with the 2018 Trek Precaliber 24 7-speed Girls bike. Designed specifically for kids and falling under the Children Bicycles category, this bike is perfect for little riders who are ready to explore. With a brand name synonymous with quality, Trek ensures that this bike is built to last and adapt to the needs of growing children. The 7-speed gear system makes it easy for young cyclists to handle various terrains, while the model year 2018 guarantees modern features suited for safety and comfort. Priced at $319.99, the Trek Precaliber is an investment in your child's outdoor fitness and fun."
    },
    {
        "id": "280",
        "title": "Trek Superfly 24 - 2017/2018",
        "content": "Introduce your young ones to the joy of cycling with the Trek Superfly 24, a premier choice among Children Bicycles. Crafted by the renowned brand Trek, this bike is designed for kids who are ready to take on more challenging rides. The 2018 model year ensures the bike includes modern features that promote comfort and safety for young riders. With a list price of $489.99, the Trek Superfly 24 is an investment in your child's outdoor activity and fitness. It's the perfect companion for budding cyclists looking to explore on two wheels."
    },
    {
        "id": "281",
        "title": "Electra Cruiser 7D (24-Inch) Ladies - 2016/2018",
        "content": "Introducing the charming and stylish 2018 Electra Cruiser 7D (24-Inch) Ladies bike, perfect for young riders who want to cruise around town in style. This delightful addition to the Children Bicycles category combines the classic design of Electra with modern features, making it ideal for leisurely rides and everyday adventures. The 24-inch size is perfect for easy handling and comfort. With a model year of 2018, this bike incorporates contemporary technology ensuring reliability and fun. Affordably priced at $319.99, the Electra Cruiser 7D offers an excellent blend of quality and value for young cycling enthusiasts."
    },
    {
        "id": "282",
        "title": "Electra Cyclosaurus 1 (16-inch) - Boys",
        "content": "Introduce your little adventurer to the joy of cycling with the 2018 Electra Cyclosaurus 1 (16-inch) for Boys. Designed specifically for kids, this bike falls under the Children Bicycles category and is perfect for young riders ready to explore on two wheels. Electra has crafted this bike with a fun dinosaur-themed design that's sure to excite any child. With a model year of 2018, it features up-to-date safety and comfort features, ensuring a reliable and enjoyable ride. The list price of $279.99 makes it an affordable option for families looking to invest in quality and lasting memories. Electra's commitment to excellence is evident in every pedal of the Cyclosaurus."
    },
    {
        "id": "283",
        "title": "Electra Heartchya 1 (20-inch) - Girls",
        "content": "Introduce your little girl to the joy of cycling with the 2018 Electra Heartchya 1 (20-inch). This charming bike, nestled within the Children Bicycles category, is perfect for young riders ready to explore their neighborhood on two wheels. The Electra brand ensures a delightful design paired with reliable construction, making it a great choice for those first biking adventures. The model year 2018 brings modern features to a classic activity, and with a list price of $319.99, it offers a fantastic start for the budding cyclist in your family. Embark on a journey of fun, learning, and exercise with the Electra Heartchya 1."
    },
    {
        "id": "284",
        "title": "Electra Savannah 1 (20-inch) - Girls",
        "content": "Introduce your little one to the joy of cycling with the 2018 Electra Savannah 1, a 20-inch bike designed specifically for girls. This charming bicycle falls under the Children Bicycles category and is perfect for young riders ready to explore their neighborhood on two wheels. Electra has created a bike that combines style and functionality, ensuring a comfortable and safe ride. With a model year of 2018, it features up-to-date design and build-quality, all for a list price of $319.99. The Electra Savannah 1 is an excellent choice for inspiring a love of cycling in your child."
    },
    {
        "id": "285",
        "title": "Electra Soft Serve 1 (16-inch) - Girls",
        "content": "Introduce your little girl to the joy of cycling with the 2018 Electra Soft Serve 1, a delightful 16-inch bike designed specifically for young riders. Falling under the category of Children Bicycles, this charming bike combines a playful aesthetic with the reliability and quality that Electra is known for. The model year 2018 signifies that it's equipped with modern features tailored for comfort and safety, ensuring a smooth ride for your child. Priced at $279.99, the Electra Soft Serve 1 offers an affordable way to spark a lifelong love for biking in your child's heart."
    },
    {
        "id": "286",
        "title": "Electra Starship 1 16 - 2018",
        "content": "Introduce your child to the joy of cycling with the 2018 Electra Starship 1 16. Designed specifically for young riders, this bike falls under the Children Bicycles category, offering a fun and safe riding experience. The 16-inch wheels are perfect for kids to maneuver easily, and the model year 2018 means that it features contemporary design and child-friendly technology. With a list price of $279.99, the Electra Starship 1 is an affordable option that doesn't compromise on quality or style. Get ready to watch your little one embark on their cycling adventures with Electra's renowned reliability and flair."
    },
    {
        "id": "287",
        "title": "Electra Straight 8 1 (16-inch) - Boys by Electra",
        "content": "Introduce your little one to the joy of cycling with the 2018 Electra Straight 8 1 (16-inch) for Boys. This stylish and sturdy children's bicycle, falling under the category of Children Bicycles, is perfect for kids embarking on their first biking adventures. With a design tailored for comfort and safety, this bike ensures a secure ride for young enthusiasts. The model year 2018 brings modern features to this bike, and the list price of $279.99 is a great investment for a high-quality, reliable bicycle from the renowned brand Electra."
    },
    {
        "id": "288",
        "title": "Electra Straight 8 1 (20-inch) - Boys - 2018",
        "content": "Introduce your young one to the joy of cycling with the 2018 Electra Straight 8 1, specifically designed for boys. This stylish Children Bicycle combines fun and function, making it perfect for kids who are ready to ride. With a 20-inch frame tailored for young riders, the Electra Straight 8 1 ensures comfort and safety on every adventure. The model year 2018 signifies a bike equipped with modern features that cater to the energetic spirit of children. Priced at $389.99, it offers a fantastic way to spark a lifetime of biking enthusiasm in your child, backed by Electra's reputation for quality and reliability."
    },
    {
        "id": "289",
        "title": "Electra Superbolt 1 20 by Electra",
        "content": "Introduce your child to the joy of cycling with the 2018 Electra Superbolt 1 20. This vibrant children's bicycle falls under the Children Bicycles category and is perfect for young riders taking on their first adventures. The Electra brand is known for crafting reliable and fun bikes, and the Superbolt 1 20 is no exception. With a model year of 2018, it boasts modern features tailored for kids' comfort and safety. Priced at $319.99, it's an investment in your child's active lifestyle and countless hours of enjoyment."
    },
    {
        "id": "290",
        "title": "Electra Superbolt 3i 20 by Electra",
        "content": "Introduce your child to the joy of cycling with the 2018 Electra Superbolt 3i 20. This stylish and fun bike, falling under the Children Bicycles category, is perfect for young riders looking to cruise around the neighborhood or park. The Electra Superbolt 3i comes equipped with features suitable for developing cyclists and boasts the quality of the Electra brand. With a model year of 2018, this bike incorporates modern design with a list price of $369.99, making it an attractive and affordable option for parents seeking a reliable bicycle for their kids."
    },
    {
        "id": "291",
        "title": "Electra Sweet Ride 1 (20-inch) - Girls by Electra",
        "content": "Introduce your little girl to the joy of cycling with the 2018 Electra Sweet Ride 1 (20-inch) for girls. This delightful bike falls under the Children Bicycles category and is designed to provide a safe and enjoyable riding experience for young riders. With its charming design and reliable construction, the Electra Sweet Ride 1 offers both comfort and style. The model year 2018 signifies a bike equipped with modern features tailored for kids, while the list price of $319.99 ensures a great value for a starter bicycle. Elevate your child's outdoor activities with the quality and fun of Electra's Sweet Ride."
    },
    {
        "id": "292",
        "title": "Electra Sweet Ride 3i (20-inch) - Girls by Electra",
        "content": "Make your little girl's cycling dreams come true with the 2018 Electra Sweet Ride 3i (20-inch) - Girls. This charming bike, which falls under the Children Bicycles category, is perfect for young riders looking to explore the neighborhood or parks. With Electra's renowned quality and delightful design, this bike features a comfortable riding position and safe, reliable components. The model year 2018 reflects modern features tailored for kids' enjoyment and safety, while the list price of $369.99 ensures a great value for a bike that can create countless happy memories."
    },
    {
        "id": "293",
        "title": "Electra Tiger Shark 1 (20-inch) - Boys by Electra",
        "content": "Get your young adventurer pedaling with the 2018 Electra Tiger Shark 1 (20-inch) - Boys. This cool bike, falling under the Children Bicycles category, is perfect for kids eager to explore their neighborhood or parks. It's designed with a youthful and fun aesthetic, but doesn't compromise on Electra's quality and durability. The 2018 model year means it includes modern features that are kid-friendly and safe for young riders. Priced at $319.99, it's an investment in your child's active lifestyle and joy. Let the fun begin with an Electra bike made just for boys!"
    },
    {
        "id": "294",
        "title": "Electra Tiger Shark 3i (20-inch) - Boys by Electra",
        "content": "Introduce your young adventurer to the joy of cycling with the 2018 Electra Tiger Shark 3i (20-inch) - Boys. This vibrant children's bicycle falls under the category of Children Bicycles and is perfect for boys ready to explore their neighborhood on two wheels. Crafted by Electra, a brand renowned for quality and fun designs, this bike is equipped with a three-speed internal gear system that's simple to use and maintain. The 2018 model year ensures that your child is riding the latest in kid-friendly technology, while the list price of $369.99 is an investment in countless hours of healthy outdoor fun. Gear up for those exciting two-wheeled adventures with Electra's Tiger Shark 3i!"
    },
    {
        "id": "295",
        "title": "Electra Treasure 1 20 by Electra",
        "content": "Introduce your child to the joy of cycling with the 2018 Electra Treasure 1 20. This charming bike, falling under the Children Bicycles category, is perfect for young riders eager to explore their neighborhood on two wheels. The Electra brand is renowned for crafting reliable and fun bikes, and this model is no exception. With a 2018 model year, it features contemporary design and child-friendly technology. Priced at $319.99, the Electra Treasure 1 20 offers a fantastic blend of quality, durability, and affordability for the budding cyclist in your family."
    },
    {
        "id": "296",
        "title": "Electra Treasure 3i 20 - 2018",
        "content": "Introduce your child to the joy of cycling with the 2018 Electra Treasure 3i 20. This delightful bike falls under the Children Bicycles category, perfect for young riders taking on their first adventures. The Electra brand promises a combination of fun design and quality construction, ensuring safety and durability for those playful days. With a model year of 2018, the Electra Treasure 3i is equipped with the latest features that make learning to ride a breeze. The inviting list price of $369.99 makes it an accessible choice for parents looking to invest in a quality bike that will support their child's growth and enthusiasm for cycling."
    },
    {
        "id": "297",
        "title": "Electra Under-The-Sea 1 16 - 2018",
        "content": "Introduce your child to the joy of cycling with the Electra Under-The-Sea 1 16 bike, designed especially for kids. As part of the Children Bicycles category, this 2018 model year bike is perfect for young riders. With Electra's renowned quality, the Under-The-Sea 1 provides a safe and fun introduction to biking, featuring a design that captures the imagination. Priced at $279.99, it's an investment in your child's outdoor activities and development of motor skills. Make their first ride unforgettable with the Electra Under-The-Sea 1."
    },
    {
        "id": "298",
        "title": "Electra Water Lily 1 (16-inch) - Girls by Electra",
        "content": "Introduce your little girl to the joy of cycling with the 2018 Electra Water Lily 1 (16-inch) - Girls' bicycle. This charming bike, falling under the category of Children Bicycles, is specially designed for young riders. With Electra's reputation for quality and the right blend of safety and style, this bike is perfect for kids ready to explore on two wheels. The 2018 model year ensures modern features suitable for children, and a list price of $279.99 makes it an affordable option for families looking for a reliable and fun bicycle for their daughters. Give the gift of adventure with the Electra Water Lily 1."
    },
    {
        "id": "299",
        "title": "Electra Townie Original 21D - 2018",
        "content": "Cruise through your neighborhood with ease on the 2018 Electra Townie Original 21D. Perfectly placed in the Comfort Bicycles category, this bike offers a relaxed ride for those leisurely trips around town. Featuring a user-friendly design and a model year of 2018, you can enjoy the latest in comfort bike technology. Affordably priced at $559.99, the Townie Original 21D by Electra promises a smooth, enjoyable cycling experience without breaking the bank."
    },
    {
        "id": "300",
        "title": "Electra Townie Balloon 3i EQ Ladies - 2018",
        "content": "Cruise through your neighborhood in style with the 2018 Electra Townie Balloon 3i EQ Ladies. This charming comfort bicycle is perfect for leisurely rides with its ergonomic design and eye-catching aesthetics. Designed specifically for women, it falls under the Comfort Bicycles category, offering a relaxing cycling experience. The 2018 model year combines modern features with a classic touch, and the list price of $799.99 ensures you're getting a premium bike without breaking the bank. Enjoy the smooth ride and superior comfort that Electra is known for."
    },
    {
        "id": "301",
        "title": "Electra Townie Balloon 7i EQ - 2018",
        "content": "Cruise through your neighborhood in style with the 2018 Electra Townie Balloon 7i EQ. This comfort bicycle, falling within the Comfort Bicycles category, offers a smooth and plush ride, perfect for leisurely weekend jaunts or daily commutes. Its unique design and advanced features combine to provide an unparalleled riding experience. The 2018 model year reflects the latest in comfort cycling innovation, while the list price of $899.99 ensures you're investing in premium quality and lasting value. Enjoy the perfect blend of luxury and functionality with Electra's elegant Townie Balloon 7i EQ."
    },
    {
        "id": "302",
        "title": "Electra Townie Original 1 - 2018",
        "content": "Cruise through your neighborhood with ease and style on the 2018 Electra Townie Original 1. This comfort bicycle is a perfect blend of modern design and classic functionality. Belonging to the Comfort Bicycles category, it offers an enjoyable and relaxed riding experience. The 2018 model year combines the latest in bicycle technology with a price point of $449.99 that won't break the bank. Electra ensures that every ride is a pleasure, whether you're commuting to work or just enjoying a leisurely weekend ride."
    },
    {
        "id": "303",
        "title": "Electra Townie Go! 8i - 2017/2018",
        "content": "Redefine comfort on your daily commutes with the 2018 Electra Townie Go! 8i. This premium comfort bicycle, falling under the Comfort Bicycles category, offers an unparalleled riding experience with its innovative design and technology. The Electra Townie Go! 8i is perfect for the rider who values ease and relaxation without compromising on style. Boasting a model year of 2018, this bike incorporates modern features that ensure a smooth and enjoyable ride. With a list price of $2599.99, it stands as a testament to Electra's dedication to quality, comfort, and rider satisfaction."
    },
    {
        "id": "304",
        "title": "Electra Townie Original 21D EQ",
        "content": "Experience the perfect blend of comfort and style with the 2018 Electra Townie Original 21D EQ. This elegant comfort bicycle, which falls under the Comfort Bicycles category, offers a relaxed riding position ideal for leisurely cruises and daily commutes. The bike's unique design and the 2018 model year reflect Electra's commitment to combining modern features with classic charm. Priced at $679.99, the Townie Original 21D EQ is an excellent investment for those who prioritize comfort and quality in their cycling experience."
    },
    {
        "id": "305",
        "title": "Electra Townie Balloon 3i EQ - 2017/2018",
        "content": "Cruise the city streets in style with the 2018 Electra Townie Balloon 3i EQ. This elegant comfort bicycle, part of the Comfort Bicycles category, is perfect for a smooth and enjoyable ride. The bike features balloon tires that enhance stability and cushion the ride, making it ideal for leisurely trips around town. Its model year of 2018 reflects the latest in comfortable cycling innovations, while the list price of $749.99 is a great investment for a premium-quality, stylish bike. Enjoy a relaxed biking experience with Electra's renowned design and craftsmanship."
    },
    {
        "id": "306",
        "title": "Electra Townie Balloon 7i EQ Ladies - 2017/2018",
        "content": "Experience the perfect blend of comfort and style with the 2018 Electra Townie Balloon 7i EQ Ladies bike. Part of the Comfort Bicycles category, this bike is designed with a relaxed seating position and user-friendly features that make riding a joy. Whether cruising through city streets or enjoying a scenic park trail, the Townie Balloon 7i EQ ensures a smooth and enjoyable ride. Boasting a model year of 2018, it incorporates contemporary design with Electra's renowned quality. Available for $899.99, this bike offers a fantastic riding experience for those who value comfort without compromising on elegance."
    },
    {
        "id": "307",
        "title": "Electra Townie Balloon 8D EQ",
        "content": "Ride in comfort and style with the 2018 Electra Townie Balloon 8D EQ. This elegant comfort bicycle, listed under Comfort Bicycles, is perfect for leisurely rides through the city or serene paths in the park. Its unique design and engineering ensure a relaxed and enjoyable cycling experience. The 2018 model year boasts the latest advancements in comfort bike technology, while the list price of $749.99 provides you with a premium bike without the premium price tag. Embrace the joy of cycling with the impeccable craftsmanship of Electra."
    },
    {
        "id": "308",
        "title": "Electra Townie Balloon 8D EQ Ladies - 2018",
        "content": "Cruise through your neighborhood in style with the 2018 Electra Townie Balloon 8D EQ Ladies bike. Perfectly placed in the Comfort Bicycles category, this bike is designed for riders who value comfort and ease of use. The Electra Townie Balloon 8D EQ features a relaxed seating position, smooth-riding balloon tires, and user-friendly 8-speed gearing, making it the ideal choice for leisurely rides and daily commutes. With a list price of $749.99, this elegant and functional bike offers a harmonious blend of affordability and luxury for the discerning cyclist."
    },
    {
        "id": "309",
        "title": "Electra Townie Commute 27D - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute 27D. This comfort bicycle, falling under the Comfort Bicycles category, is perfect for those looking for a blend of convenience and style on their everyday rides. Boasting a relaxed riding position and user-friendly features, the Townie Commute 27D ensures a smooth and enjoyable journey. With a model year of 2018, you can trust in its modern design and functionality. Priced at $899.99, this Electra bike offers a premium commuting experience at a competitive value."
    },
    {
        "id": "310",
        "title": "Electra Townie Commute 27D Ladies - 2018",
        "content": "Experience the perfect blend of comfort and style with the 2018 Electra Townie Commute 27D Ladies bike. Designed specifically for the Comfort Bicycles category, this bike offers a relaxed and enjoyable ride for those leisurely commutes or peaceful neighborhood cruises. The Electra brand is known for crafting bikes with an emphasis on ergonomic design, and this model is no exception. With a model year of 2018, it boasts modern features and a smooth riding experience. Priced at $899.99, it represents a fantastic investment for those seeking a combination of luxury and practicality in their daily travels. Make your rides a delightful part of your day with the Townie Commute 27D Ladies bike."
    },
    {
        "id": "311",
        "title": "Electra Townie Commute 8D - 2018",
        "content": "Make your daily commute a breeze with the 2018 Electra Townie Commute 8D. This bike falls under the Comfort Bicycles category, offering a smooth and enjoyable ride for your everyday travel. It's designed to maximize comfort without sacrificing efficiency, making it ideal for leisurely rides and city commuting alike. The model year 2018 reflects modern features and design, ensuring a reliable and stylish biking experience. With a list price of $749.99, the Electra Townie Commute 8D offers a perfect blend of comfort, quality, and value for those looking to enjoy cycling with ease."
    },
    {
        "id": "312",
        "title": "Electra Townie Commute 8D Ladies - 2018",
        "content": "Commute in style and comfort with the 2018 Electra Townie Commute 8D Ladies bike. Perfectly placed in the Comfort Bicycles category, this bike is designed for the urban rider who values the balance between a comfortable riding experience and an efficient commute. The 2018 model year brings you the latest in cycling comfort technology, while the $699.99 list price is a great investment for a premium commuting bicycle. Enjoy the perfect blend of elegance and functionality with Electra's dedication to quality and rider satisfaction."
    },
    {
        "id": "313",
        "title": "Electra Townie Original 1 Ladies - 2018",
        "content": "Experience the perfect blend of comfort and style with the 2018 Electra Townie Original 1 Ladies bike. Designed specifically under the Comfort Bicycles category, this bike offers a relaxed and enjoyable ride, ideal for leisurely cruises around town. The 2018 model year combines modern design with a classic touch, ensuring a timeless appeal. Priced at $449.99, the Electra Townie Original 1 Ladies is an affordable option for those seeking a quality bike that promises both comfort and durability. Embrace the joy of cycling with Electra's dedication to excellence and comfort."
    },
    {
        "id": "314",
        "title": "Electra Townie Original 21D EQ Ladies - 2018",
        "content": "Cruise through your neighborhood or take leisurely rides through the park with the 2018 Electra Townie Original 21D EQ Ladies. This elegant comfort bicycle, part of the Comfort Bicycles category, is perfect for a relaxed and enjoyable ride. Its step-through frame design makes mounting and dismounting effortless for ladies, while 21 speeds offer versatility for various terrains. Built with attention to comfort and ease of use, this model comes with a list price of $679.99, offering a great blend of style, comfort, and affordability. Electra's commitment to quality is evident in this charming and well-equipped bike."
    },
    {
        "id": "315",
        "title": "Electra Townie Original 21D Ladies - 2018",
        "content": "Cruise through the city in style with the 2018 Electra Townie Original 21D Ladies bike. This elegant ride is a standout in the Comfort Bicycles category, offering a blend of comfort and ease of use for the urban cyclist. With its 2018 model year, you're equipped with the latest features designed for a smooth and enjoyable ride. Priced at $559.99, this Electra bike provides a premium experience without breaking the bank. Embrace leisurely rides and weekend adventures with the reliability and charm of the Electra Townie Original 21D Ladies."
    },
    {
        "id": "316",
        "title": "Trek Checkpoint ALR 4 Women's - 2019",
        "content": "Hit the road with style and performance on the 2019 Trek Checkpoint ALR 4 Women's. As part of the Road Bikes category, this bicycle is engineered for speed and agility. The sleek design is tailored for female cyclists, providing an optimal fit and comfort for long rides. With a model year of 2019, you'll benefit from the latest advancements in bike technology. Priced at $1,699.99, the Trek Checkpoint ALR 4 Women's represents a wise investment for cyclists who demand quality and durability. Gear up for your next road adventure with this exceptional offering from Trek."
    },
    {
        "id": "317",
        "title": "Trek Checkpoint ALR 5 - 2019",
        "content": "Hit the pavement with speed and style on the 2019 Trek Checkpoint ALR 5. This premium road bike, falling under the Road Bikes category, is engineered for the avid cyclist seeking performance and versatility. Crafted by the renowned brand Trek, the Checkpoint ALR 5 is built to deliver a balance of comfort and agility on long rides. Its model year 2019 signifies a bike equipped with modern features and design, and the list price of $1999.99 is a testament to its high-quality components and craftsmanship. Gear up for your next road adventure with the precision and excellence of Trek."
    },
    {
        "id": "318",
        "title": "Trek Checkpoint ALR 5 Womens - 2019",
        "content": "Take on the open road with the 2019 Trek Checkpoint ALR 5 Women's road bike. Crafted with precision by the renowned brand Trek, this bike falls under the category of Road Bikes and is perfect for both seasoned cyclists and enthusiastic beginners. The model year 2019 embodies the latest in cycling technology, offering reliability and top-notch performance. With a list price of $1,999.99, the Trek Checkpoint ALR 5 Women's bike provides exceptional value for cyclists seeking quality and durability. Embrace the thrill of the ride with a bike that's built to deliver a superior road cycling experience."
    },
    {
        "id": "319",
        "title": "Trek Checkpoint SL 5 Women's - 2019",
        "content": "Hit the open road with the 2019 Trek Checkpoint SL 5 Women's road bike. Tailored for performance and designed with style, this bike falls under the Road Bikes category and is perfect for both seasoned riders and those new to the sport. The 2019 model year brings with it the latest in cycling technology, ensuring a smooth and efficient ride. With a list price of $2799.99, the Trek Checkpoint SL 5 offers quality and durability that's well worth the investment for cycling enthusiasts. Embrace the speed and agility that Trek is known for with this exceptional road bike."
    },
    {
        "id": "320",
        "title": "Trek Checkpoint SL 6 - 2019",
        "content": "Hit the open road with the 2019 Trek Checkpoint SL 6, a premium addition to the Road Bikes category. Designed for serious cyclists and enthusiasts alike, this model offers a blend of speed, agility, and endurance. Crafted by the renowned brand Trek, the Checkpoint SL 6 stands out with its advanced features and superior build quality. With a model year of 2019, you can trust that you're getting the latest in cycling innovation. Priced at $3799.99, this bike is an investment in your passion for road cycling, promising exhilarating rides and unmatched performance."
    },
    {
        "id": "321",
        "title": "Trek Checkpoint ALR Frameset - 2019",
        "content": "Hit the pavement with style and performance with the 2019 Trek Checkpoint ALR Frameset. This premium road bike, falling under the Road Bikes category, is engineered for both speed and endurance. Crafted by Trek, a brand synonymous with quality and innovation, the Checkpoint ALR Frameset is perfect for cyclists seeking a reliable and high-performing setup. The 2019 model year ensures that you are equipped with the latest advancements in road bike technology. Priced at $3199.99, this frameset is an investment in your cycling passion, offering unmatched quality and the thrill of the ride."
    }
]